[
  {
    "id": 1,
    "title": "Python's del: Remove References From Scopes and Containers",
    "url": "https://realpython.com/python-del-statement/",
    "pub_date": null,
    "tags": [
      "python",
      "best-practices",
      "basics"
    ],
    "description": "In this tutorial, you'll learn how Python's del statement works and how to use it in your code. This statement will allow you to remove references from different scopes, items from lists, keys from dictionaries, and members from classes. This will lead to potentially memory-efficient code.",
    "text": "Getting to Know Python’s del Statement\n Python’s del statement allows you to remove references to objects from a given namespace or container type. It performs an operation that’s the opposite of what an assignment statement does. It’s sort of an unassignment statement that allows you to unbind one or more names from their referenced objects.This is a natural feature to have in Python. If you can create a variable by writing variable = value, then you must have the option to undo this operation by deleting variable. That’s where del comes on the scene.The del statement can come in handy in different coding situations, such as:Of course, this list is incomplete. You may find some other appropriate use cases for this statement. In this tutorial, you’ll learn how the del statement works and how to use it in your code. To kick things off, you’ll start by learning the general syntax of del in Python.A Python del statement consists of the del keyword, followed by a comma-separated series of references.Note: In this tutorial, you’ll use the term reference to generically designate names or identifiers that can hold references to objects in Python.Here’s the general syntax of the del statement in Python:The del statement allows you to remove one or more references from a given namespace. It also lets you delete data from mutable container types, such as lists and dictionaries.You’ll often use this statement with a single argument. However, it also supports a series of arguments separated by commas.In the above construct, reference_* represents any kind of identifier that can hold references to concrete objects stored in memory. In practice, these references can include:You can use any of these references as arguments to del. If you use a comma-separated series of arguments, then keep in mind that del operates on every argument sequentially from left to right. This behavior can be risky when you’re removing items from lists, as you’ll learn later in this tutorial.Here’s a quick example of using del to remove a variable:Once you’ve run the del statement, the variable greeting is no longer available. If you try to access greeting, then you get a NameError because that variable doesn’t exist anymore.Removing reference holders like variables is the primary goal of del. This statement doesn’t remove objects. In the following section, you’ll dive deeper into the actual and immediate effects of running a del statement.Unlock This Article\nAlready a member? Sign-In\n",
    "preview": false
  },
  {
    "id": 2,
    "title": "How to Read Python Input as Integers",
    "url": "https://realpython.com/python-input-integer/",
    "pub_date": null,
    "tags": [
      "basics"
    ],
    "description": "In this tutorial, you'll learn how to use Python to get integer input from the user while handling any errors resulting from non-numeric input. This will involve coding your own reusable function built around input().",
    "text": "Dealing With Invalid Input\n You’ve probably already noticed that the above code is hopelessly optimistic. You can’t always rely on users to provide the kind of input that you expect. You can help a lot by providing an explicit prompt message, but through confusion, carelessness, or malice, there’ll always be users who provide invalid input. Your program should be ready to deal with any kind of text.Unlock This Article\nAlready a member? Sign-In\n",
    "preview": false
  },
  {
    "id": 3,
    "title": "The Terminal: First Steps and Useful Commands",
    "url": "https://realpython.com/terminal-commands/",
    "pub_date": "2023-02-22T14:00:00+00:00",
    "tags": [
      "basics",
      "tools"
    ],
    "description": "The terminal is an essential tool in your journey as a Python developer.\r\nThis tutorial helps you to get started with the terminal, pip, and Git by showcasing interesting commands that you can incorporate into your workflow.",
    "text": "Conclusion\n When you’re comfortable using the terminal, then you’ll probably be able to navigate your file system faster and with more control than when using your mouse and clicking buttons.In this tutorial, you’ve learned how to:You’ve boosted your programming skills by learning how to do three really important tasks in the terminal: navigate the file system, manage Python packages with pip, and make commits to Git. Learning terminal commands is a great investment for you as a Python developer. Just take your time and get to know this powerful tool step by step. Soon enough, it’ll be an important tool in your repertoire that you can’t live without.How important is the terminal for your workflow as a Python developer? Are there any essential commands that you would add to the tutorial? Let the Real Python community know in the comments below!Free Download: Click here to get a free cheat sheet of useful commands to get you started working with the terminal.",
    "preview": false
  },
  {
    "id": 4,
    "title": "Build a Wordle Clone With Python and Rich",
    "url": "https://realpython.com/python-wordle-clone/",
    "pub_date": "2023-02-06T14:00:00+00:00",
    "tags": [
      "basics",
      "projects"
    ],
    "description": "In this step-by-step project, you'll build your own Wordle clone with Python. Your game will run in the terminal, and you'll use Rich to ensure your word-guessing app looks good. Learn how to build a command-line application from scratch and then challenge your friends to a wordly competition!",
    "text": "Next Steps\n While your Wordle clone already has the most important features in place, there are many ways in which you can change or improve the project. You’ve already noted some of these in the tutorial:Only allow guesses from a list of valid words: This will make the game extra challenging because you can’t just throw some letters together to check if they appear in the secret word. To implement this, you need a comprehensive word list.Create a topical Wordle clone: The word list that you’ve downloaded in this tutorial is based on the words in the tutorial itself. It might be more interesting to create a word list based on a theme that interests you. Maybe you can create a list of programming terms, people’s names, or Shakespearean plays.Add a splash screen: A splash—or intro—screen is a nice way to prepare your user for what they’re in for. To make your application easier to use, you can also add some in-game instructions—for example, to explain the aim of the game and what the different colors represent.Have fun exploring your own Wordle variants. Also, remember that you can use most of the principles you’ve learned in this tutorial when you build other command-line applications. So, what will you make next?",
    "preview": false
  },
  {
    "id": 5,
    "title": "The Python Standard REPL: Try Out Code and Ideas Quickly",
    "url": "https://realpython.com/python-repl/",
    "pub_date": "2023-01-25T14:00:00+00:00",
    "tags": [
      "basics",
      "tools"
    ],
    "description": "In this tutorial, you'll learn how to use the Python standard REPL (Read-Eval-Print Loop) to run your code interactively. This tool will allow you to test new ideas, explore and experiment with new tools and libraries, refactor and debug your code, try out examples, and more.",
    "text": "Conclusion\n You’ve learned how to work with Python in interactive mode using the standard shell, or REPL (Read-Eval-Print Loop). This tool comes in every Python installation so that you can use it at any moment to test new ideas, explore and experiment with new tools and libraries, refactor and debug your code, try out examples, and more.In this tutorial, you’ve learned how to:You’ve also learned about alternative and feature-rich REPLs, such as IDLE, IPython, bpython, and ptpython, which provide IDE-like features that can highly improve your user experience and productivity while working in interactive mode.Free Sample Code: Click here to download the free sample code that you’ll use to explore the capabilities of Python’s standard REPL.",
    "preview": false
  },
  {
    "id": 6,
    "title": "Python's \"in\" and \"not in\" Operators: Check for Membership",
    "url": "https://realpython.com/python-in-operator/",
    "pub_date": "2022-12-19T14:00:00+00:00",
    "tags": [
      "python",
      "best-practices",
      "basics"
    ],
    "description": "In this tutorial, you'll learn how to check if a given value is present or absent in a collection of values using Python's in and not in operators, respectively. This type of check is known as membership test in Python.",
    "text": "Conclusion\n Now you know how to perform membership tests using Python’s in and not in operators. This type of test allows you to check if a given value is present in a collection of values, which is a pretty common operation in programming.In this tutorial, you’ve learned how to:With this knowledge, you’re good to go with membership tests using Python’s in and not in operators in your code.Source Code: Click here to download the free source code that you’ll use to perform membership tests in Python with in and not in.",
    "preview": false
  },
  {
    "id": 7,
    "title": "Advent of Code: Solving Your Puzzles With Python",
    "url": "https://realpython.com/python-advent-of-code/",
    "pub_date": "2022-11-30T14:00:00+00:00",
    "tags": [
      "basics",
      "testing"
    ],
    "description": "Advent of Code is an online advent calendar that shares new programming puzzles each day from December 1 to the 25. In this tutorial, you'll learn why solving programming puzzles can be beneficial and how you can get started with Advent of Code using Python.",
    "text": "Conclusion\n Advent of Code is a great resource of fun programming puzzles! You can use it to practice your problem-solving skills and challenge your friends to a fun competition and common learning experience. You can hear even more about Advent of Code in the following episode of the Real Python Podcast: Solving Advent of Code Puzzles With Python.If you haven’t already done so, then head over to the Advent of Code website and try out some of the new puzzles.In this tutorial, you’ve learned:Real Python hosts a private leaderboard and a community forum about Advent of Code. Become a Real Python member and join the #advent-of-code Slack channel to access it.Source Code: Click here to download the free source code that shows you how to solve Advent of Code puzzles with Python.",
    "preview": false
  },
  {
    "id": 8,
    "title": "How to Add Python to PATH",
    "url": "https://realpython.com/add-python-to-path/",
    "pub_date": "2022-09-26T14:00:00+00:00",
    "tags": [
      "best-practices",
      "devops",
      "basics"
    ],
    "description": "In this tutorial, you'll learn about how to add Python, or any other program, to your PATH environment variable. You'll be covering the procedure in Windows, macOS, and Linux and find out what PATH is and why it's important.",
    "text": "Conclusion\n In this tutorial, you’ve learned how to add Python, or any other program, to your PATH environment variable on Windows, Linux, and macOS. You also learned a bit more about what PATH is and why its internal order is vital to consider. Finally, you also discovered how you might manage your PATH on a UNIX-based system, seeing as it’s more complex than managing your PATH on Windows.Supplemental Code: Click here to download free supplemental code that’ll walk you through changing PATH across operating systems.",
    "preview": false
  },
  {
    "id": 9,
    "title": "How to Replace a String in Python",
    "url": "https://realpython.com/replace-string-python/",
    "pub_date": "2022-09-14T14:00:00+00:00",
    "tags": [
      "best-practices",
      "basics"
    ],
    "description": "In this tutorial, you'll learn how to remove or replace a string or substring. You'll go from the basic string method .replace() all the way up to a multi-layer regex pattern using the sub() function from Python's re module.",
    "text": "Conclusion\n In this tutorial, you’ve learned how to replace strings in Python. Along the way, you’ve gone from using the basic Python .replace() string method to using callbacks with re.sub() for absolute control. You’ve also explored some regex patterns and deconstructed them into a better architecture to manage a replacement script.With all that knowledge, you’ve successfully cleaned a chat transcript, which is now ready for independent review. Not only that, but your transcript-sanitizing script has plenty of room to grow.Sample Code: Click here to download the free sample code that you’ll use to replace strings in Python.",
    "preview": false
  },
  {
    "id": 10,
    "title": "HTML and CSS for Python Developers",
    "url": "https://realpython.com/html-css-python/",
    "pub_date": "2022-09-07T14:00:00+00:00",
    "tags": [
      "web-dev",
      "django",
      "flask",
      "front-end",
      "basics"
    ],
    "description": "There's no way around HTML and CSS when you want to build web apps.\r\nEven if you're not aiming to become a web developer, knowing the basics of HTML and CSS will help you understand the Web better.\r\nIn this tutorial, you'll get an introduction to HTML and CSS for Python programmers.",
    "text": "Conclusion\n No matter which path to becoming a Python web developer you choose, there’s no way around HTML and CSS.\nBoth technologies are fundamental building blocks when you want to create websites.Throughout this tutorial, you built a boilerplate HTML document to give you a head-start in your upcoming web projects.Along the way, you learned how to:Python, HTML, and CSS are a powerful trio that enables you to create small HTML documents and big web projects.\nBut even if you’re not aiming for a career as a web developer, knowing a thing or two about HTML and CSS will help you understand the Web better.Free Bonus: Click here to download the supplemental materials for this tutorial, including a time-saving HTML template file.",
    "preview": false
  },
  {
    "id": 11,
    "title": "How to Check if a Python String Contains a Substring",
    "url": "https://realpython.com/python-string-contains-substring/",
    "pub_date": "2022-08-22T14:00:00+00:00",
    "tags": [
      "best-practices",
      "basics"
    ],
    "description": "In this tutorial, you'll learn the best way to check whether a Python string contains a substring. You'll also learn about idiomatic ways to inspect the substring further, match substrings with conditions using regular expressions, and search for substrings in pandas.",
    "text": "Conclusion\n Like a persistent treasure hunter, you found each \"secret\", no matter how well it was hidden! In the process, you learned that the best way to check whether a string contains a substring in Python is to use the in membership operator.You also learned how to descriptively use two other string methods, which are often misused to check for substrings:After that, you explored how to find substrings according to more advanced conditions with regular expressions and a few functions in Python’s re module.Finally, you also learned how you can use the DataFrame method .str.contains() to check which entries in a pandas DataFrame contain a substring .You now know how to pick the most idiomatic approach when you’re working with substrings in Python. Keep using the most descriptive method for the job, and you’ll write code that’s delightful to read and quick for others to understand.Free Download: Click here to download the sample code that you’ll use to check if a string contains a substring.",
    "preview": false
  },
  {
    "id": 12,
    "title": "How to Find an Absolute Value in Python",
    "url": "https://realpython.com/python-absolute-value/",
    "pub_date": "2022-08-17T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this tutorial, you'll learn how to calculate the absolute value in Python using the built-in abs() function. You'll also implement the corresponding mathematical formulas from scratch. Finally, you'll change the behavior of abs() in your own classes by hooking into Python's interface.",
    "text": "Conclusion\n Implementing formulas for an absolute value in Python is a breeze. However, Python already comes with the versatile abs() function, which lets you calculate the absolute value of various types of numbers, including integers, floating-point numbers, complex numbers, and more. You can also use abs() on instances of custom classes and third-party library objects.In this tutorial, you learned how to:With this knowledge, you’re equipped with an efficient tool to calculate absolute values in Python.Sample Code: Click here to download the sample code that you’ll use to find absolute values in Python.",
    "preview": false
  },
  {
    "id": 13,
    "title": "Your Python Coding Environment on Windows: Setup Guide",
    "url": "https://realpython.com/python-coding-setup-windows/",
    "pub_date": "2022-07-25T14:00:00+00:00",
    "tags": [
      "basics",
      "tools"
    ],
    "description": "With this opinionated guide to setting up a basic, fully featured and flexible setup for Python coding and open source contributing when working from Windows, you'll go from a fresh install to ready to contribute, and even check out a PowerShell script to automate much of the process.",
    "text": "Other Nifty Windows Software\n Now that you have Windows all set up for Python coding, you may want to make your life even easier. Here are some great Windows utilities that can help you do just that:With these utilities installed, you’re ready to tackle any coding challenge.",
    "preview": false
  },
  {
    "id": 14,
    "title": "NumPy's max() and maximum(): Find Extreme Values in Arrays",
    "url": "https://realpython.com/numpy-max-maximum/",
    "pub_date": "2022-07-13T14:00:00+00:00",
    "tags": [
      "data-science",
      "basics"
    ],
    "description": "In this introduction to NumPy, you'll learn how to find extreme values using the max() and maximum() functions. This includes finding the maximum element in an array or along a given axis of an array, as well as comparing two arrays to find the larger element in each index position.",
    "text": "Conclusion\n In this tutorial, you’ve explored the NumPy library’s max() and maximum() operations to find the maximum values within or across arrays. Here’s what you’ve learned:Along the way, you’ve learned or refreshed your knowledge of the basics of NumPy syntax. NumPy is a hugely popular library because of its powerful support for array operations.Now that you’ve mastered the details of NumPy’s max() and maximum(), you’re ready to use them in your applications, or continue learning about more of the hundreds of array functions supported by NumPy.Free Bonus: Click here to get access to a free NumPy Resources Guide that points you to the best tutorials, videos, and books for improving your NumPy skills.If you’re interested in using NumPy for data science, then you’ll also want to investigate pandas, a  very popular data-science library built on top of NumPy. You can learn about it in The Pandas DataFrame: Make Working With Data Delightful. And if you want to produce compelling images from data, take a look at Python Plotting With Matplotlib (Guide).The applications of NumPy are limitless. Wherever your NumPy adventure takes you next, go forth and matrix-multiply!",
    "preview": false
  },
  {
    "id": 15,
    "title": "How Can You Emulate Do-While Loops in Python?",
    "url": "https://realpython.com/python-do-while/",
    "pub_date": "2022-06-20T14:00:00+00:00",
    "tags": [
      "python",
      "best-practices",
      "basics"
    ],
    "description": "In this tutorial, you'll learn how to emulate do-while loops in Python. The most common technique to do this is to create an infinite while loop with a conditional statement that controls the loop and jumps out of it using a break statement.",
    "text": "Conclusion\n In this tutorial, you’ve learned to emulate a do-while loop in Python. The language doesn’t have this loop construct, which you can find in languages like C, C++, Java, and JavaScript. You learned that you can always write a do-while loop with the help of a regular while loop, and you can use one of several different patterns to accomplish it.The most common technique to emulate do-while loops is to create an infinite while loop with a conditional statement at the end of the loop’s body. This conditional controls the loop and jumps out of it using the break statement.You also learned how to use a couple of alternative techniques to provide the same functionality as a do-while loop. Your options include doing the first set of operations before the loop or using a Boolean variable initially set to True to control the loop.With all this knowledge, you’re ready to start emulating do-while loops in your own Python code.Free Download: Get a sample chapter from Python Tricks: The Book that shows you Python’s best practices with simple examples you can apply instantly to write more beautiful + Pythonic code.",
    "preview": false
  },
  {
    "id": 16,
    "title": "Build Your Python Project Documentation With MkDocs",
    "url": "https://realpython.com/python-project-documentation-with-mkdocs/",
    "pub_date": "2022-06-15T14:00:00+00:00",
    "tags": [
      "basics",
      "projects",
      "tools"
    ],
    "description": "In this tutorial, you'll learn how to build professional documentation for a Python package using MkDocs and mkdocstrings. These tools allow you to generate nice-looking and modern documentation from Markdown files and, more importantly, from your code's docstrings.",
    "text": "Next Steps\n You can use the same approach outlined in this tutorial to document your own Python project. Follow the tutorial a second time, but instead of using the calculator module, write the documentation for your own package. This process will help train your understanding of how to create helpful documentation.Additionally, here are some ideas to take your project documentation to the next level:What other ideas can you come up with to improve your project documentation and make it less effort for you to keep it up-to-date? Be creative, have fun, and leave a comment below!",
    "preview": false
  },
  {
    "id": 17,
    "title": "Build a Quiz Application With Python",
    "url": "https://realpython.com/python-quiz-application/",
    "pub_date": "2022-06-08T14:00:00+00:00",
    "tags": [
      "basics",
      "projects"
    ],
    "description": "In this step-by-step project, you'll build a Python quiz application for the terminal. Your app will ask you multiple-choice questions that you can use to strengthen your own knowledge or challenge your friends to test theirs.",
    "text": "Next Steps\n As you’ve followed along in this tutorial, you’ve created a well-featured quiz application. However, there’s still ample opportunity to improve on the project.Here are some ideas for additional features:You can also reuse the logic in this quiz application but change the front-end presentation layer. Maybe you can convert the project to a web application or create a flashcards app to help you prepare for your quizzes. Feel free to share your improvements in the comments below.",
    "preview": false
  },
  {
    "id": 18,
    "title": "Top Python Game Engines",
    "url": "https://realpython.com/top-python-game-engines/",
    "pub_date": "2022-05-04T14:00:00+00:00",
    "tags": [
      "gamedev",
      "basics"
    ],
    "description": "In this tutorial, you'll explore several Python game engines available to you. For each, you'll code simple examples and a more advanced game to learn the game engine's strengths and weaknesses.",
    "text": "Conclusion\n Congratulations, great game design is now within your reach! Thanks to Python and a buffet of highly capable Python game engines, you can create quality computer games much more easily than before. In this tutorial, you’ve explored several such game engines, learning the information that you need to start crafting your own Python video games!By now, you’ve seen some of the top Python game engines in action, and you’ve:If you’d like to review the code for the games in this tutorial, you can do so by clicking the link below:Get Source Code: Click here to get the source code you’ll use to try out Python game engines.Now you can choose the best Python game engine for your purpose. So what are you waiting for? Get out there and write some games!",
    "preview": false
  },
  {
    "id": 19,
    "title": "Python's min() and max(): Find Smallest and Largest Values",
    "url": "https://realpython.com/python-min-and-max/",
    "pub_date": "2022-05-02T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this tutorial, you'll learn how to use Python's built-in min() and max() functions to find the smallest and largest values. You'll also learn how to modify their standard behavior by providing a suitable key function. Finally, you'll code a few practical examples of using min() and max().",
    "text": "Conclusion\n Now you know how to use Python’s built-in min() and max() functions to find the smallest and largest values in an iterable or in a series of two or more regular arguments. You also learned about a few other characteristics of min() and max() that can make them useful in your day-to-day programming.In this tutorial, you learned how to:Additionally, you’ve coded a handful of practical examples using min() and max() to approach real-world problems that you might run into while coding. You’ve also a written custom version of min() and max() in pure Python, a nice learning exercise that helped you understand the logic behind these built-in functions.Free Bonus: 5 Thoughts On Python Mastery, a free course for Python developers that shows you the roadmap and the mindset you’ll need to take your Python skills to the next level.",
    "preview": false
  },
  {
    "id": 20,
    "title": "Python GUI Programming With Tkinter",
    "url": "https://realpython.com/python-gui-tkinter/",
    "pub_date": "2022-03-30T14:00:00+00:00",
    "tags": [
      "gui",
      "basics"
    ],
    "description": "In this tutorial, you'll learn the basics of GUI programming with Tkinter, the de facto Python GUI framework. Master GUI programming concepts such as widgets, geometry managers, and event handlers. Then, put it all together by building two applications: a temperature converter and a text editor.",
    "text": "Additional Resources\n In this tutorial, you touched on just the foundations of creating Python GUI applications with Tkinter. There are a number of additional topics that aren’t covered here. In this section, you’ll find some of the best resources available to help you continue on your journey.Tkinter ReferencesHere are some official resources to check out:Additional WidgetsIn this tutorial, you learned about the Label, Button, Entry, Text, and Frame widgets. There are several other widgets in Tkinter, all of which are essential for building real-world applications. Here are some resources to continue learning about widgets:Application DistributionOnce you’ve created an application with Tkinter, you probably want to distribute it to your colleagues and friends. Here are some tutorials to get you going with that process:Other GUI FrameworksTkinter isn’t your only choice for a Python GUI framework. If Tkinter doesn’t meet the needs of your project, then here are some other frameworks to consider: Take the Quiz: Test your knowledge with our interactive “Python GUI Programming With Tkinter” quiz. Upon completion you will receive a score so you can track your learning progress over time:",
    "preview": false
  },
  {
    "id": 21,
    "title": "Manage Your To-Do Lists Using Python and Django",
    "url": "https://realpython.com/django-todo-lists/",
    "pub_date": "2022-03-02T14:00:00+00:00",
    "tags": [
      "web-dev",
      "basics",
      "projects",
      "django"
    ],
    "description": "Use Django to build a to-do list manager app. This step-by-step project will teach you how to use Django's class-based views to build a powerful app while dramatically reducing your development time.",
    "text": "Next Steps\n Now that you’ve completed this tutorial, it’s time to think about where you can go from here. By further developing this app, you can build your knowledge and consolidate your skills while creating an attractive addition to your programming portfolio. Here are a few suggestions for what you might do next:Style the application: The to-do list application’s user interface (UI) is unapologetically bland and unadorned. Simple.css has helped you to create an acceptable UI, but nothing more than that. You might want to investigate some ways to improve it:The Simple.css website has links to several sites that have built on the base CSS from Simple.css to produce something more attractive.There are many other free CSS libraries out there! For instance, you could investigate Bootstrap, Semantic UI, or Font Awesome.You can also use raw CSS. CSS is an extremely powerful styling tool, and if you’re willing to invest the time to learn its ins and outs, there’s no limit to what you can make it do.Enhance the application: There are plenty of useful features that you could add to this application. One obvious improvement would be to handle task completion and deadlines. You could add a completed field to the to-do items so that your users can distinguish between completed tasks and those that still need action. You could even add logic to send email reminders if they miss due dates.Make it multi-user: If you find a to-do list manager useful, then a logical step might be to extend it to multiple users, such as members of your team. Each user could have their own space with their individual to-do lists, and you could consider implementing shared lists to enable cooperative planning. In this case, you should explore some of Django’s security options, as well as learning about a multi-user database like MySQL or Postgres.Explore more class-based views:\nIn this project, you’ve made use of several of Django’s generic class-based views. But Django has a rich architecture of class-based views and mixins to enable maximum code reuse, and you’ve hardly scratched the surface here. You can read much more about your options in the official Django documentation on class-based views.Build your expertise with more Django projects: Real Python has many Django project tutorials at different levels. Now that you’ve completed this one, you might want to investigate some of these:",
    "preview": false
  },
  {
    "id": 22,
    "title": "Python's all(): Check Your Iterables for Truthiness",
    "url": "https://realpython.com/python-all/",
    "pub_date": "2022-02-09T14:00:00+00:00",
    "tags": [
      "python",
      "best-practices",
      "basics"
    ],
    "description": "In this step-by-step tutorial, you'll learn how to use Python's all() function to check if all the items in an iterable are truthy. You'll also code various examples that showcase a few interesting use cases of all() and highlight how you can use this function in Python.",
    "text": "Conclusion\n Now you know how to check if all the items in an existing iterable are truthy by using Python’s built-in all() function. You also know how to use this function to find out if the items in an iterable meet a given condition or have a specific property.With this knowledge, you’re now able to write more readable and efficient Python code.In this tutorial, you learned:Additionally, you coded several practical examples that helped you understand how powerful all() can be and what some of its most common use cases in Python programming are.Free PDF Download: Python 3 Cheat Sheet",
    "preview": false
  },
  {
    "id": 23,
    "title": "Using Python's pip to Manage Your Projects' Dependencies",
    "url": "https://realpython.com/what-is-pip/",
    "pub_date": "2022-02-02T14:00:00+00:00",
    "tags": [
      "basics",
      "tools"
    ],
    "description": "What is pip? In this beginner-friendly tutorial, you'll learn how to use pip, the standard package manager for Python, so that you can install and manage packages that aren't part of the Python standard library.",
    "text": "Conclusion\n Many Python projects use the pip package manager to manage their dependencies. It’s included with the Python installer, and it’s an essential tool for dependency management in Python.In this tutorial, you learned how to:In addition, you’ve learned about the importance of keeping dependencies up to date and alternatives to pip that can help you manage those dependencies.By taking a closer look at pip, you’ve explored an essential tool in your Python development workflows. With pip, you can install and manage any additional packages that you find on PyPI. You can use external packages from other developers as requirements and concentrate on the code that makes your project unique.",
    "preview": false
  },
  {
    "id": 24,
    "title": "Raining Outside? Build a Weather CLI App With Python",
    "url": "https://realpython.com/build-a-python-weather-app-cli/",
    "pub_date": "2022-01-26T14:00:00+00:00",
    "tags": [
      "basics",
      "api"
    ],
    "description": "In this tutorial, you'll write a nicely formatted Python CLI app that displays information about the current weather in any city you provide the name for.",
    "text": "Next Steps\n If the thunderstorm where you are just won’t die down, and you want to continue working on this project, you can consider the following ideas to take your weather app to the next level:What other ideas can you come up with to extend this project? Be creative and have fun!",
    "preview": false
  },
  {
    "id": 25,
    "title": "Build a Dice-Rolling Application With Python",
    "url": "https://realpython.com/python-dice-roll/",
    "pub_date": "2022-01-19T14:00:00+00:00",
    "tags": [
      "basics",
      "projects"
    ],
    "description": "In this step-by-step project, you'll build a dice-rolling simulator app with a minimal text-based user interface using Python. The app will simulate the rolling of up to six dice. Each individual die will have six sides.",
    "text": "Next Steps\n Now that you’ve finished building your dice-rolling application, you can take the project a step further by adding new functionality. Adding new features by yourself will help you continue to learn exciting new coding concepts and techniques.Here are some ideas to take your project to the next level:The first feature will require you to modify the code that processes the user’s input for the number of dice to roll. You’ll also need to modify the code that generates and displays the diagram of dice faces. For example, you can generate a diagram that displays the dice faces in several rows to avoid cluttering your screen with cramped output.On the other hand, supporting dice with a different number of faces will demand that you tweak the code that simulates a dice-rolling event. You’ll also need to create new ASCII art for any dice with more than six faces.Once you’re done with these new features, you can change gears and jump into other cool projects. Here are some great next steps for you to continue learning Python and building more complex projects:How to Build Command Line Interfaces in Python With argparse: In this step-by-step Python tutorial, you’ll learn how to take your command-line Python scripts to the next level by adding a convenient command-line interface that you can write with argparse.Build a Python Directory Tree Generator for the Command Line: In this step-by-step project, you’ll create a Python directory tree generator application for your command line. You’ll code the command-line interface with argparse and traverse the file system using pathlib.Build a Command-Line To-Do App With Python and Typer: In this step-by-step project, you’ll create a to-do application for your command line using Python and Typer. While you build this app, you’ll learn the basics of Typer, a modern and versatile library for building command-line interfaces.",
    "preview": false
  },
  {
    "id": 26,
    "title": "Using the \"not\" Boolean Operator in Python",
    "url": "https://realpython.com/python-not-operator/",
    "pub_date": "2021-10-25T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this step-by-step tutorial, you'll learn how Python's \"not\" operator works and how to use it in your code. You'll get to know its features and see what kind of programming problems you can solve by using \"not\" in Python.",
    "text": "Conclusion\n Python’s not is a logical operator that inverts the truth value of Boolean expressions and objects. It’s handy when you need to check for unmet conditions in conditional statements and while loops.You can use the not operator to help you decide the course of action in your program. You can also use it to invert the value of Boolean variables in your code.In this tutorial, you learned how to:To these ends, you coded a few practical examples that helped you understand some of the main use cases of the not operator, so you’re now better prepared to use it in your own code.",
    "preview": false
  },
  {
    "id": 27,
    "title": "Using the len() Function in Python",
    "url": "https://realpython.com/len-python-function/",
    "pub_date": "2021-10-20T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this tutorial, you'll learn how and when to use the len() Python function. You'll also learn how to customize your class definitions so that objects of a user-defined class can be used as arguments in len().",
    "text": "Conclusion\n You’ve explored how to use len() to determine the number of items in sequences, collections, and other data types that hold several items at a time, such as NumPy arrays and pandas DataFrames.The len() Python function is a key tool in many programs. Some of its uses are straightforward, but there’s a lot more to this function than its most basic use cases, as you’ve seen in this tutorial. Knowing when you can use this function and how to use it effectively will help you write neater code.In this tutorial, you’ve learned how to:You now have a good foundation for understanding the len() function. Learning more about len() helps you understand the differences between data types better. You’re ready to use len() in your algorithms and to improve the functionality of some of your class definitions by enhancing them with the .__len__() method.",
    "preview": false
  },
  {
    "id": 28,
    "title": "Representing Rational Numbers With Python Fractions",
    "url": "https://realpython.com/python-fractions/",
    "pub_date": "2021-10-11T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this tutorial, you'll learn about the Fraction data type in Python, which can represent rational numbers precisely without the rounding errors in binary arithmetic. You'll find that this is especially important in financial and other high-precision applications.",
    "text": "Conclusion\n You might have never thought about how computers store fractional numbers before reading this tutorial. After all, maybe it seemed that your good old friend float could handle them just fine. However, history has shown that this misconception may eventually lead to catastrophic failures that can cost big money.Using Python’s Fraction is one way to avoid such catastrophes. You’ve seen the pros and cons of fractional notation, its practical applications, and methods for using it in Python. Now, you can make an informed choice about which numeric type is the most appropriate in your use case.In this tutorial, you learned how to:",
    "preview": false
  },
  {
    "id": 29,
    "title": "Python's sum(): The Pythonic Way to Sum Values",
    "url": "https://realpython.com/python-sum-function/",
    "pub_date": "2021-10-06T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this step-by-step tutorial, you'll learn how to use Python's sum() function to add numeric values together. You also learn how to concatenate sequences, such as lists and tuples, using sum().",
    "text": "Conclusion\n You can now use Python’s built-in function sum() to add multiple numeric values together. This function provides an efficient, readable, and Pythonic way to solve summation problems in your code. If you’re dealing with math computations that require summing numeric values, then sum() can be your lifesaver.In this tutorial, you learned how to:With this knowledge, you’re now able to add multiple numeric values together in a Pythonic, readable, and efficient way.",
    "preview": false
  },
  {
    "id": 30,
    "title": "Reverse Strings in Python: reversed(), Slicing, and More",
    "url": "https://realpython.com/reverse-string-python/",
    "pub_date": "2021-09-27T14:00:00+00:00",
    "tags": [
      "python",
      "best-practices",
      "basics"
    ],
    "description": "In this step-by-step tutorial, you'll learn how to reverse strings in Python by using available tools such as reversed() and slicing operations. You'll also learn about a few useful ways to build reversed strings by hand.",
    "text": "Conclusion\n Reversing and working with strings in reverse order can be a common task in programming. Python provides a set of tools and techniques that can help you perform string reversal quickly and efficiently. In this tutorial, you learned about those tools and techniques and how to take advantage of them in your string processing challenges.In this tutorial, you learned how to:Even though this topic might not have many exciting use cases by itself, understanding how to reverse strings can be useful in coding interviews for entry-level positions. You’ll also find that mastering the different ways to reverse a string can help you really conceptualize the immutability of strings in Python, which is a notable feature of the language.",
    "preview": false
  },
  {
    "id": 31,
    "title": "Using the \"and\" Boolean Operator in Python",
    "url": "https://realpython.com/python-and-operator/",
    "pub_date": "2021-09-20T14:00:00+00:00",
    "tags": [
      "python",
      "best-practices",
      "basics"
    ],
    "description": "In this step-by-step tutorial, you'll learn how Python's \"and\" operator works and how to use it in your code. You'll get to know its special features and see what kind of programming problems you can solve by using \"and\" in Python.",
    "text": "Conclusion\n Python’s and operator allows you to construct compound Boolean expressions that you can use to decide the course of action of your programs. You can use the and operator to solve several problems both in Boolean or non-Boolean contexts. Learning about how to use the and operator properly can help you write more Pythonic code.In this tutorial, you learned how to:Going through the practical examples in this tutorial can help you get a general idea of how to use the and operator to make decisions in your Python code.",
    "preview": false
  },
  {
    "id": 32,
    "title": "Build a Personal Diary With Django and Python",
    "url": "https://realpython.com/django-diary-project-python/",
    "pub_date": "2021-09-15T14:00:00+00:00",
    "tags": [
      "web-dev",
      "projects",
      "django",
      "front-end",
      "basics"
    ],
    "description": "In this beginner-friendly tutorial, you'll build a personal diary in Django. You'll use the strengths of the Django web framework and learn the basics of web apps.",
    "text": "Conclusion\n In this tutorial, you created a personal diary from scratch using Django. You learned how to build a full-featured web application that you can use day to day. It takes advantage of Django’s many strengths, including the admin site, class-based views, the message framework, and the templating system.This Django project is also a perfect basis for your future Django projects. The steps you finished in this diary project are basically the same for other projects, like a blog or a to-do app.In this tutorial, you learned how to:You can download the complete source code for the Django diary by clicking the link below:Get Source Code: Click here to get the source code you’ll use to build a personal diary web app with Django and Python in this tutorial.",
    "preview": false
  },
  {
    "id": 33,
    "title": "How Long Does It Take to Learn Python?",
    "url": "https://realpython.com/how-long-does-it-take-to-learn-python/",
    "pub_date": "2021-09-06T14:00:00+00:00",
    "tags": [
      "community",
      "basics"
    ],
    "description": "In this article, you'll assess whether or not learning Python is a good investment of your time, how long it will take you, and what background factors you need to consider when planning your learning journey. You'll also learn what resources exist that can help you get started.",
    "text": "Conclusion\n You learned about the different phases of learning Python. You considered reasons why you might want to learn to program, as well as what stages you’re likely to go through during that process.While you can start to write small scripts in Python after just a few days of study, you’ll probably spend around four months gaining an essential ability in programming with Python. You’ll have to spend years and build many projects to become a Python expert in even just one field.In this article, you learned:Learning to program in Python can be an excellent investment of your time. If you keep showing up and make it exciting and fun for yourself, then you’re more likely to find ways to integrate it into your regular habits. If you’re looking for more advice on your first steps, check out 11 Beginner Tips for Learning Python Programming.",
    "preview": false
  },
  {
    "id": 34,
    "title": "Using Python Optional Arguments When Defining Functions",
    "url": "https://realpython.com/python-optional-arguments/",
    "pub_date": "2021-08-30T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this tutorial, you'll learn about Python optional arguments and how to define functions with default values. You'll also learn how to create functions that accept any number of arguments using args and kwargs.",
    "text": "Conclusion\n Defining your own function to create a self-contained subroutine is one of the key building blocks when writing code. The most useful and powerful functions are those that perform one clear task and that you can use in a flexible manner. Using optional arguments is a key technique to achieve this.In this tutorial, you’ve learned:A good understanding of optional arguments will also help you use functions in the standard library and in other third-party modules. Displaying the documentation for these functions will show you the function signature from which you’ll be able to identify which arguments are required, which ones are optional, and which ones are args or kwargs.However, the main skill you’ve learned in this tutorial is to define your own functions. You can now start writing functions with required and optional parameters and with a variable number of non-keyword and keyword arguments. Mastering these skills will help you take your Python coding to the next level.",
    "preview": false
  },
  {
    "id": 35,
    "title": "Your First Steps With Django: Set Up a Django Project",
    "url": "https://realpython.com/django-setup/",
    "pub_date": "2021-07-21T14:05:12+00:00",
    "tags": [
      "best-practices",
      "basics",
      "django",
      "web-dev"
    ],
    "description": "This tutorial provides a walkthrough and a reference for starting a Django project and app. You can use it as a quick setup guide for any future Django project and tutorial you'll work on.",
    "text": "Conclusion\n In this tutorial, you went over all the steps necessary to set up the foundations for a new Django web application. You got familiar with the most common terminal commands that you’ll repeat over and over again when using Django for web development.You also read about why you want to use each command and what they produce, and you learned some tips and tricks associated with getting set up with Django.In this tutorial, you learned how to:After completing the steps outlined in this tutorial, you’re ready to start building your custom web application using Django. For example, you could create a portfolio app to showcase your coding projects. For a structured way to keep growing your Django skills, you can continue working through the resources provided in the Django learning path.Keep setting up the fundamental scaffolding for Django web applications until these steps become second nature. If you need a refresher, then you can always use this tutorial as a quick reference.",
    "preview": false
  },
  {
    "id": 36,
    "title": "Using FastAPI to Build Python Web APIs",
    "url": "https://realpython.com/fastapi-python-web-apis/",
    "pub_date": "2021-07-14T14:00:00+00:00",
    "tags": [
      "web-dev",
      "basics",
      "api"
    ],
    "description": "In this guide, you'll learn the main concepts of FastAPI and how to use it to quickly create web APIs that implement best practices by default. By the end of it, you will be able to start creating production-ready web APIs.",
    "text": "Conclusion\n In this tutorial, you learned about FastAPI and how to use it to create production-ready APIs that have best practices by default while providing the best developer experience possible. You learned how to:You’re now ready to start creating your own highly performant APIs for your projects. If you want to dive deeper into the world of FastAPI, then you can follow the official User Guide in the FastAPI documentation.",
    "preview": false
  },
  {
    "id": 37,
    "title": "What Can I Do With Python?",
    "url": "https://realpython.com/what-can-i-do-with-python/",
    "pub_date": "2021-07-07T14:00:00+00:00",
    "tags": [
      "basics"
    ],
    "description": "In this tutorial, you'll find a set of guidelines that will help you start applying your Python skills to real-world problems. By the end of your reading, you'll be able to answer the question \"What can I do with Python?\"",
    "text": "Next Steps\n So there you have it! An extensive list of topics and practical projects to start working your way from Python beginner to savvy Pythonista.No matter where you choose to begin, you’ll be opening up countless avenues for growing your programming skills. Pick something and get started! Do you have an idea for a practical project that isn’t here? Leave a comment down below! You could suggest the perfect project for a fellow programmer.If you get stuck and need a nudge in the right direction, then check out 11 Beginner Tips for Learning Python Programming to help get yourself back on track.Another great way to get unstuck is to talk it out. Coding doesn’t have to be a solitary activity. If you need a way to ask questions and get answers quickly from knowledgeable Python developers, then consider joining The Real Python Member’s Slack community. Everyone is welcome, no matter how much experience you have. You can always help others and also get help from others.",
    "preview": false
  },
  {
    "id": 38,
    "title": "Python's Counter: The Pythonic Way to Count Objects",
    "url": "https://realpython.com/python-counter/",
    "pub_date": "2021-07-05T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this step-by-step tutorial, you'll learn how to use Python's Counter to count several repeated objects at once.",
    "text": "Conclusion\n When you need to count several repeated objects in Python, you can use Counter from collections. This class provides an efficient and Pythonic way to count things without the need for using traditional techniques involving loops and nested data structures. This can make your code cleaner and faster.In this tutorial, you learned how to:You also learned the basics of using Counter instances as multisets. With all this knowledge, you’ll be able to quickly count objects in your code and also to perform math operations with multisets.",
    "preview": false
  },
  {
    "id": 39,
    "title": "Reverse Python Lists: Beyond .reverse() and reversed()",
    "url": "https://realpython.com/python-reverse-list/",
    "pub_date": "2021-06-28T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this step-by-step tutorial, you'll learn about Python's tools and techniques to work with lists in reverse order. You'll also learn how to reverse your list by hand.",
    "text": "Conclusion\n Reversing and working with lists in reverse order might be a fairly common task in your day-to-day work as a Python coder. In this tutorial, you took advantage of a couple of Python tools and techniques to reverse your lists and manage them in reverse order.In this tutorial, you learned how to:All of this knowledge helps you improve your list-related skills. It provides you with the required tools to be more proficient when you’re working with Python lists.",
    "preview": false
  },
  {
    "id": 40,
    "title": "Natural Language Processing With Python's NLTK Package",
    "url": "https://realpython.com/nltk-nlp-python/",
    "pub_date": "2021-05-05T14:00:00+00:00",
    "tags": [
      "data-science",
      "basics"
    ],
    "description": "In this beginner-friendly tutorial, you'll take your first steps with Natural Language Processing (NLP) and Python's Natural Language Toolkit (NLTK). You'll learn how to process unstructured data in order to be able to analyze it and draw conclusions from it.",
    "text": "Conclusion\n Congratulations on taking your first steps with NLP! A whole new world of unstructured data is now open for you to explore. Now that you’ve covered the basics of text analytics tasks, you can get out there are find some texts to analyze and see what you can learn about the texts themselves as well as the people who wrote them and the topics they’re about.Now you know how to:For your next step, you can use NLTK to analyze a text to see whether the sentiments expressed in it are positive or negative. To learn more about sentiment analysis, check out Sentiment Analysis: First Steps With Python’s NLTK Library. If you’d like to dive deeper into the nuts and bolts of NLTK, then you can work your way through Natural Language Processing with Python—Analyzing Text with the Natural Language Toolkit.Now get out there and find yourself some text to analyze!",
    "preview": false
  },
  {
    "id": 41,
    "title": "Python Basics: Paperback Now Available!",
    "url": "https://realpython.com/python-basics-paperback/",
    "pub_date": "2021-04-26T14:00:00+00:00",
    "tags": [
      "community",
      "basics"
    ],
    "description": "After years of writing, reviewing, and testing, we’re delighted to announce that Python Basics: A Practical Introduction to Python 3 is now available in paperback! In this article, you’ll see how you can level up your Python with Python Basics and how other Pythonistas have already been doing it.",
    "text": "Level Up Your Python With Python Basics!\n It’s been rewarding to hear that readers have been getting so much out of this book, and we’d love to hear from you! The feedback we received from the Real Python community was priceless—and we’re all extremely happy with how the final book turned out. Thanks for your support! To get your hands on the book, click the link below:Once you’ve got the book, it would be a huge help if you could add your own review and rating to Amazon. And please feel free to reach out to us directly to let us know how your Python journey is going and what kinds of learning resources you need to take your next big step.",
    "preview": false
  },
  {
    "id": 42,
    "title": "How to Use Python: Your First Steps",
    "url": "https://realpython.com/python-first-steps/",
    "pub_date": "2021-01-25T16:27:13+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this step-by-step tutorial, you'll learn the basics of how to use Python. With this knowledge, you'll be able to start coding your Python applications.",
    "text": "Conclusion\n Learning how to use Python and get your programming skills to the next level is a worthwhile endeavor. Python is a popular, productive, and powerful high-level programming language that is in high demand. In this tutorial, you learned essential concepts about Python and started to apply them to your Python code.In this tutorial, you learned:You also created your first Python program and ran it on your computer. With all this knowledge, you can dive deeper into Python and learn a lot more of the language.",
    "preview": false
  },
  {
    "id": 43,
    "title": "C for Python Programmers",
    "url": "https://realpython.com/c-for-python-programmers/",
    "pub_date": "2021-01-20T14:00:00+00:00",
    "tags": [
      "basics"
    ],
    "description": "In this tutorial, you'll learn the basics of the C language, which is used in the source code for CPython, the most popular Python implementation. Learning C is important for Python programmers interested in contributing to CPython.",
    "text": "Conclusion\n This wraps up your quick walk through C syntax. Although this description barely scratches the surface of the C language, you now have sufficient knowledge to read and understand the CPython source code.In this tutorial, you learned:Now that you’re familiar with C, you can deepen your knowledge of the inner workings of Python by exploring the CPython source code. Happy Pythoning!Note: If you enjoyed what you learned in this sample from CPython Internals: Your Guide to the Python Interpreter, then be sure to check out the rest of the book.",
    "preview": false
  },
  {
    "id": 44,
    "title": "Make Your First Python Game: Rock, Paper, Scissors!",
    "url": "https://realpython.com/python-rock-paper-scissors/",
    "pub_date": "2021-01-18T14:00:00+00:00",
    "tags": [
      "gamedev",
      "basics",
      "projects"
    ],
    "description": "In this tutorial, you'll learn to program rock paper scissors in Python from scratch. You'll learn how to take in user input, make the computer choose a random action, determine a winner, and split your code into functions.",
    "text": "Conclusion\n Congratulations! You just finished your first Python game! You now know how to create rock paper scissors from scratch, and you’re able to expand the number of possible actions in your game with minimal effort. In this tutorial, you learned how to:These tools will continue to help you throughout your many programming adventures. If you have any questions, then feel free to reach out in the comments section below.",
    "preview": false
  },
  {
    "id": 45,
    "title": "NumPy Tutorial: Your First Steps Into Data Science in Python",
    "url": "https://realpython.com/numpy-tutorial/",
    "pub_date": "2021-01-11T14:00:00+00:00",
    "tags": [
      "data-science",
      "basics"
    ],
    "description": "In this tutorial, you'll learn everything you need to know to get up and running with NumPy, Python's de facto standard for multidimensional data arrays. NumPy is the foundation for most data science in Python, so if you're interested in that field, then this is a great place to start.",
    "text": "Conclusion\n No matter how many dimensions your data lives in, NumPy gives you the tools to work with it. You can store it, reshape it, combine it, filter it, and sort it, and your code will read like you’re operating on only one number at a time rather than hundreds or thousands.In this tutorial, you learned:Don’t forget to check out the repository of NumPy code samples from throughout this tutorial. You can use it for reference and experiment with the examples to see how changing the code changes the outcome:Get Sample Code: Click here to get the sample code you’ll use to learn about NumPy in this tutorial.Now you’re ready for the next steps in your data science journey. Whether you’re cleaning data, training neural networks, communicating using powerful plots, or aggregating data from the Internet of Things, these activities all start from the same place: the humble NumPy array.",
    "preview": false
  },
  {
    "id": 46,
    "title": "Python's .append(): Add Items to Your Lists in Place",
    "url": "https://realpython.com/python-append/",
    "pub_date": "2021-01-04T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this step-by-step tutorial, you'll learn how Python's .append() works and how to use it for adding items to your list in place. You'll also learn how to code your own stacks and queues using .append() and .pop().",
    "text": "Conclusion\n Python provides a method called .append() that you can use to add items to the end of a given list. This method is widely used either to add a single item to the end of a list or to populate a list using a for loop. Learning how to use .append() will help you process lists in your programs.In this tutorial, you learned:In addition, you coded some examples of how to use .append() to create data structures, such as stacks and queues. This knowledge will allow you to use .append() to grow your lists efficiently and effectively.",
    "preview": false
  },
  {
    "id": 47,
    "title": "The pass Statement: How to Do Nothing in Python",
    "url": "https://realpython.com/python-pass/",
    "pub_date": "2020-12-16T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this tutorial, you'll learn about the Python pass statement, which tells the interpreter to do nothing. Even though pass has no effect on program execution, it can be useful. You'll see several use cases for pass as well as some alternative ways to do nothing in your code.",
    "text": "Conclusion\n You now understand what the Python pass statement does. You’re ready to use it to improve your development and debugging speed as well as to deploy it tactfully in your production code.In this tutorial, you’ve learned:Now you’ll be able to write better and more efficient code by knowing how to tell Python to do nothing.",
    "preview": false
  },
  {
    "id": 48,
    "title": "What Is Data Engineering and Is It Right for You?",
    "url": "https://realpython.com/python-data-engineer/",
    "pub_date": "2020-12-14T14:00:00+00:00",
    "tags": [
      "basics"
    ],
    "description": "In this article, you'll get an overview of the discipline of data engineering. You'll learn what is and isn't part of a data engineer's job, who data engineers work with, and why data engineers play a crucial role in many industries.",
    "text": "Conclusion\n That completes your introduction to the field of data engineering, one of the most in-demand disciplines for people with a background or interest in computer science and technology! In this tutorial, you learned:Now you’re at the point where you can decide if you want to go deeper and learn more about this exciting field. Does data engineering sound fascinating to you? Are you interested in exploring it more deeply? Let us know in the comments!",
    "preview": false
  },
  {
    "id": 49,
    "title": "Python enumerate(): Simplify Looping With Counters",
    "url": "https://realpython.com/python-enumerate/",
    "pub_date": "2020-11-18T14:00:00+00:00",
    "tags": [
      "best-practices",
      "basics"
    ],
    "description": "Once you learn about for loops in Python, you know that using an index to access items in a sequence isn't very Pythonic. So what do you do when you need that index value? In this tutorial, you'll learn all about Python's built-in enumerate(), where it's used, and how you can emulate its behavior.",
    "text": "Conclusion\n Python’s enumerate() lets you write Pythonic for loops when you need a count and the value from an iterable. The big advantage of enumerate() is that it returns a tuple with the counter and value, so you don’t have to increment the counter yourself. It also gives you the option to change the starting value for the counter.In this tutorial, you learned how to:You also saw enumerate() used in some real-world code, including within the CPython code repository. You now have the superpower of simplifying your loops and making your Python code stylish!",
    "preview": false
  },
  {
    "id": 50,
    "title": "Python Modulo in Practice: How to Use the % Operator",
    "url": "https://realpython.com/python-modulo-operator/",
    "pub_date": "2020-10-26T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this tutorial, you'll learn about the Python modulo operator (%). You'll look at the mathematical concepts behind the modulo operation and how the modulo operator is used with Python's numeric types. You'll also see ways to use the modulo operator in your own code.",
    "text": "Conclusion\n At first glance, the Python modulo operator may not grab your attention. Yet, as you’ve seen, there’s so much to this humble operator. From checking for even numbers to encrypting text with ciphers, you’ve seen many different uses for the modulo operator.In this tutorial, you’ve learned how to:With the knowledge you’ve gained in this tutorial, you can now start using the modulo operator in your own code with great success. Happy Pythoning!",
    "preview": false
  },
  {
    "id": 51,
    "title": "Python's map(): Processing Iterables Without a Loop",
    "url": "https://realpython.com/python-map-function/",
    "pub_date": "2020-09-30T14:00:00+00:00",
    "tags": [
      "python",
      "best-practices",
      "basics"
    ],
    "description": "In this step-by-step tutorial, you'll learn how Python's map() works and how to use it effectively in your programs. You'll also learn how to use list comprehension and generator expressions to replace map() in a Pythonic and efficient way.",
    "text": "Conclusion\n Python’s map() allows you to perform mapping operations on iterables. A mapping operation consists of applying a transformation function to the items in an iterable to generate a transformed iterable. In general, map() will allow you to process and transform iterables without using an explicit loop.In this tutorial, you’ve learned how map() works and how to use it to process iterables. You also learned about some Pythonic tools that you can use to replace map() in your code.You now know how to:With this new knowledge, you’ll be able to use map() in your code and approach your code with a functional programming style. You can also switch to a more Pythonic and modern style by replacing map() with a list comprehension or a generator expression.",
    "preview": false
  },
  {
    "id": 52,
    "title": "The Python return Statement: Usage and Best Practices",
    "url": "https://realpython.com/python-return-statement/",
    "pub_date": "2020-09-28T14:00:00+00:00",
    "tags": [
      "python",
      "best-practices",
      "basics"
    ],
    "description": "In this step-by-step tutorial, you'll learn how to use the Python return statement when writing functions. Additionally, you'll cover some good programming practices related to the use of return. With this knowledge, you'll be able to write readable, robust, and maintainable functions in Python.",
    "text": "Conclusion\n The Python return statement allows you to send any Python object from your custom functions back to the caller code. This statement is a fundamental part of any Python function or method. If you master how to use it, then you’ll be ready to code robust functions.In this tutorial, you’ve learned how to:Additionally, you’ve learned some more advanced use cases for the return statement, like how to code a closure factory function and a decorator function. With this knowledge, you’ll be able to write more Pythonic, robust, and maintainable functions in Python.",
    "preview": false
  },
  {
    "id": 53,
    "title": "Numbers in Python",
    "url": "https://realpython.com/python-numbers/",
    "pub_date": "2020-09-16T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this tutorial, you'll learn about numbers and basic math in Python. You'll explore integer, floating-point numbers, and complex numbers and see how perform calculations using Python's arithmetic operators, math functions, and number methods.",
    "text": "Further Reading\n For additional information on numbers and math in Python, check out these resources:",
    "preview": false
  },
  {
    "id": 54,
    "title": "Find & Fix Code Bugs in Python: Debug With IDLE",
    "url": "https://realpython.com/python-debug-idle/",
    "pub_date": "2020-09-09T14:00:00+00:00",
    "tags": [
      "basics",
      "tools"
    ],
    "description": "In this tutorial, you'll learn how to identify and fix logic errors, or bugs, in your Python code. You'll use the built-in debugging tools in Python's Integrated Development and Learning Environment to practice locating and resolving bugs in an example function.",
    "text": "Conclusion: Python Debugging With IDLE\n That’s it! You now know all about debugging using IDLE’s Debug window. You can use the basic principles you used here with a number of different debugging tools. You’re now well equipped to start debugging your Python code.In this tutorial, you learned:You also got some practice debugging a faulty function using a four-step process for identifying and removing bugs:Debugging is as much an art as it is a science. The only way to master debugging is to get a lot of practice with it! One way to get some practice is to open the Debug Control window and use it to step through your code as you work on the exercises and challenges you find in other Real Python tutorials. For more information on debugging Python code, check out Python Debugging With Pdb. If you enjoyed what you learned in this sample from Python Basics: A Practical Introduction to Python 3, then be sure to check out the rest of the book.",
    "preview": false
  },
  {
    "id": 55,
    "title": "Python 3 Installation & Setup Guide",
    "url": "https://realpython.com/installing-python/",
    "pub_date": "2020-08-31T16:15:29+00:00",
    "tags": [
      "best-practices",
      "basics",
      "tools"
    ],
    "description": "The first step to getting started with Python is to install it on your machine. In this tutorial, you'll learn how to check which version of Python, if any, you have on your Windows, Mac, or Linux computer and the best way to install the most recent version in any environment.",
    "text": "Conclusion\n Congratulations! You now have access to the latest version of Python for your system. Your Python journey is just beginning.In this tutorial you’ve learned how to:You’re now ready to get started programming in Python! Be sure to share your progress and any questions you may have in the comments below.",
    "preview": false
  },
  {
    "id": 56,
    "title": "Common Python Data Structures (Guide)",
    "url": "https://realpython.com/python-data-structures/",
    "pub_date": "2020-08-26T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this tutorial, you'll learn about Python's data structures. You'll look at several implementations of abstract data types and learn which implementations are best for your specific use cases.",
    "text": "Conclusion: Python Data Structures\n That concludes your tour of common data structures in Python. With the knowledge you’ve gained here, you’re ready to implement efficient data structures that are just right for your specific algorithm or use case.In this tutorial, you’ve learned:If you enjoyed what you learned in this sample from Python Tricks, then be sure to check out the rest of the book. If you’re interested in brushing up on your general data structures knowledge, then I highly recommend Steven S. Skiena’s The Algorithm Design Manual. It strikes a great balance between teaching you fundamental (and more advanced) data structures and showing you how to implement them in your code. Steve’s book was a great help in the writing of this tutorial.",
    "preview": false
  },
  {
    "id": 57,
    "title": "Namespaces and Scope in Python",
    "url": "https://realpython.com/python-namespaces-scope/",
    "pub_date": "2020-07-29T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this tutorial, you'll learn about Python namespaces, the structures used to store and organize the symbolic names created during execution of a Python program. You'll learn when namespaces are created, how they are implemented, and how they define variable scope.",
    "text": "Conclusion\n Virtually everything that a Python program uses or acts on is an object. Even a short program will create many different objects. In a more complex program, they’ll probably number in the thousands. Python has to keep track of all these objects and their names, and it does so with namespaces.In this tutorial, you learned:Many programming techniques take advantage of the fact that every function in Python has its own namespace. In the next two tutorials in this series, you’ll explore two of these techniques: functional programming and recursion.",
    "preview": false
  },
  {
    "id": 58,
    "title": "Python Keywords: An Introduction",
    "url": "https://realpython.com/python-keywords/",
    "pub_date": "2020-06-15T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "Python keywords make up the fundamental building blocks of any Python program. In this tutorial, you'll learn the basic syntax and usage for each of Python's thirty-five keywords so you can write more efficient and readable code.",
    "text": "Conclusion\n Python keywords are the fundamental building blocks of any Python program. Understanding their proper use is key to improving your skills and knowledge of Python. Throughout this article, you’ve seen a few things to solidify your understanding Python keywords and to help you write more efficient and readable code. In this article, you’ve learned:If you understand most of these keywords and feel comfortable using them, then you might be interested to learn more about Python’s grammar and how the statements that use these keywords are specified and constructed.",
    "preview": false
  },
  {
    "id": 59,
    "title": "Regular Expressions: Regexes in Python (Part 2)",
    "url": "https://realpython.com/regex-python-part-2/",
    "pub_date": "2020-06-03T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In the previous tutorial in this series, you learned how to perform sophisticated pattern matching using regular expressions, or regexes, in Python.  This tutorial explores more regex tools and techniques that are available in Python.",
    "text": "Conclusion\n That concludes your tour of Python’s re module!This introductory series contains two tutorials on regular expression processing in Python. If you’ve worked through both the previous tutorial and this one, then you should now know how to:Regular expressions are extremely versatile and powerful—literally a language in their own right. You’ll find them invaluable in your Python coding.Note: The re module is great, and it will likely serve you well in most circumstances. However, there’s an alternative third-party Python module called regex that provides even greater regular expression matching capability. You can learn more about it at the regex project page.Next up in this series, you’ll explore how Python avoids conflict between identifiers in different areas of code. As you’ve already seen, each function in Python has its own namespace, distinct from those of other functions. In the next tutorial, you’ll learn how namespaces are implemented in Python and how they define variable scope.",
    "preview": false
  },
  {
    "id": 60,
    "title": "Regular Expressions: Regexes in Python (Part 1)",
    "url": "https://realpython.com/regex-python/",
    "pub_date": "2020-04-29T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In previous tutorials in this series, you've seen several different ways to compare string values with direct character-by-character comparison. In this tutorial, you'll learn how to perform more complex string pattern matching using regular expressions, or regexes, in Python.",
    "text": "Conclusion\n This concludes your introduction to regular expression matching and Python’s re module. Congratulations! You’ve mastered a tremendous amount of material. You now know how to:But you’ve still seen only one function in the module: re.search()! The re module has many more useful functions and objects to add to your pattern-matching toolkit. The next tutorial in the series will introduce you to what else the regex module in Python has to offer.",
    "preview": false
  },
  {
    "id": 61,
    "title": "How to Use any() in Python",
    "url": "https://realpython.com/any-python/",
    "pub_date": "2020-03-30T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "If you've ever wondered how to simplify complex conditionals by determining if at least one in a series of conditions is true, then look no further. This tutorial will teach you all about how to use any() in Python to do just that.",
    "text": "Conclusion\n Congratulations! You’ve learned the ins and outs of using any() in Python and the differences between any() and or. With a deeper understanding of these two tools, you’re well prepared to decide between them in your own code.You now know:If you would like to continue learning about conditional expressions and how to use tools like or and any() in Python, then you can check out the following resources:",
    "preview": false
  },
  {
    "id": 62,
    "title": "Using the Python defaultdict Type for Handling Missing Keys",
    "url": "https://realpython.com/python-defaultdict/",
    "pub_date": "2020-03-11T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this step-by-step tutorial, you'll learn how the Python defaultdict type works and how to use it for handling missing keys when you're working with dictionaries. You'll also learn how to use a defaultdict to solve problems like grouping or counting the items in a sequence or collection.",
    "text": "Conclusion\n The Python defaultdict type is a dictionary-like data structure provided by the Python standard library in a module called collections. The class inherits from dict, and its main added functionality is to supply default values for missing keys. In this tutorial, you’ve learned how to use the Python defaultdict type for handling the missing keys in a dictionary.You’re now able to:The Python defaultdict type is a convenient and efficient data structure that’s designed to help you out when you’re dealing with missing keys in a dictionary. Give it a try and make your code faster, more readable, and more Pythonic!",
    "preview": false
  },
  {
    "id": 63,
    "title": "Defining Your Own Python Function",
    "url": "https://realpython.com/defining-your-own-python-function/",
    "pub_date": "2020-03-09T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this tutorial, you'll learn how to define and call your own Python function.  You'll also learn about passing data to your function, and returning data from your function back to its calling environment.",
    "text": "Conclusion\n As applications grow larger, it becomes increasingly important to modularize code by breaking it up into smaller functions of manageable size.  You now hopefully have all the tools you need to do this.You’ve learned:Next up in this series are two tutorials that cover searching and pattern matching.  You will get an in-depth look at a Python module called re, which contains functionality for searching and matching using a versatile pattern syntax called a regular expression.",
    "preview": false
  },
  {
    "id": 64,
    "title": "The Beginner's Guide to Python Turtle",
    "url": "https://realpython.com/beginners-guide-python-turtle/",
    "pub_date": "2020-02-26T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this step-by-step tutorial, you'll learn the basics of Python programming with the help of a simple and interactive Python library called turtle. If you're a beginner to Python, then this tutorial will definitely help you on your journey as you take your first steps into the world of programming.",
    "text": "Conclusion\n In this tutorial, you’ve learned how to program with the Python turtle library and grasped some very important programming concepts. You know how to deal with variable initialization, loops, conditional statements, indentations, lists, and operators. This is a great start for you, especially if you’re new to the Python programming language!Now you can:Now you’re ready to venture into some higher-level Python programming. To progress further in your Python journey, check out Introduction to Python and 11 Beginner Tips for Learning Python Programming. Just remember to work hard and keep practicing, and you’ll find that you’re a Python expert in no time!",
    "preview": false
  },
  {
    "id": 65,
    "title": "Introduction to Python SQL Libraries",
    "url": "https://realpython.com/python-sql-libraries/",
    "pub_date": "2020-02-24T14:00:00+00:00",
    "tags": [
      "databases",
      "basics",
      "tools"
    ],
    "description": "In this step-by-step tutorial, you'll learn how to connect to different database management systems by using various Python SQL libraries. You'll interact with SQLite, MySQL, and PostgreSQL databases and perform common database queries using a Python application.",
    "text": "Conclusion\n In this tutorial, you’ve learned how to use three common Python SQL libraries. sqlite3, mysql-connector-python, and psycopg2 allow you to connect a Python application to SQLite, MySQL, and PostgreSQL databases, respectively.Now you can:However, this is just the tip of the iceberg! There are also Python SQL libraries for object-relational mapping, such as SQLAlchemy and Django ORM, that automate the task of database interaction in Python. You’ll learn more about these libraries in other tutorials in our Python databases section.",
    "preview": false
  },
  {
    "id": 66,
    "title": "Null in Python: Understanding Python's NoneType Object",
    "url": "https://realpython.com/null-in-python/",
    "pub_date": "2020-02-19T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this tutorial, you'll learn about the NoneType object None, which acts as the null in Python. This object represents emptiness, and you can use it to mark default parameters and even show when you have no result. None is a tool for doing everything with nothing!",
    "text": "Conclusion\n None is a powerful tool in the Python toolbox. Like True and False, None is an immutable keyword. As the null in Python, you use it to mark missing values and results, and even default parameters where it’s a much better choice than mutable types.Now you can:How do you use the null in Python? Leave a comment down in the comments section below!",
    "preview": false
  },
  {
    "id": 67,
    "title": "A Guide to the Newer Python String Format Techniques",
    "url": "https://realpython.com/python-formatted-output/",
    "pub_date": "2020-02-17T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In the last tutorial in this series, you learned how to format string data using the string modulo operator.  In this tutorial, you'll see two more items to add to your Python string formatting toolkit. You'll learn about Python's string format method and the formatted string literal, or f-string.",
    "text": "Conclusion\n In this tutorial, you mastered two additional techniques that you can use in Python to format string data. You should now have all the tools you need to prepare string data for output or display!You might be wondering which Python formatting technique you should use. Under what circumstances would you choose .format() over the f-string? See Python String Formatting Best Practices for some considerations to take into account.In the next tutorial, you’re going to learn more about functions in Python. Throughout this tutorial series, you’ve seen many examples of Python’s built-in functions. In Python, as in most programming languages, you can define your own custom user-defined functions as well. If you can’t wait to learn how then continue on to the next tutorial!",
    "preview": false
  },
  {
    "id": 68,
    "title": "Using pandas and Python to Explore Your Dataset",
    "url": "https://realpython.com/pandas-python-explore-dataset/",
    "pub_date": "2020-01-06T14:00:00+00:00",
    "tags": [
      "data-science",
      "basics"
    ],
    "description": "In this step-by-step tutorial, you'll learn how to start exploring a dataset with pandas and Python. You'll learn how to access specific rows and columns to answer questions about your data. You'll also see how to handle missing values and prepare to visualize your dataset in a Jupyter notebook.",
    "text": "Conclusion\n In this tutorial, you’ve learned how to start exploring a dataset with the pandas Python library. You saw how you could access specific rows and columns to tame even the largest of datasets. Speaking of taming, you’ve also seen multiple techniques to prepare and clean your data, by specifying the data type of columns, dealing with missing values, and more. You’ve even created queries, aggregations, and plots based on those.Now you can:This journey using the NBA stats only scratches the surface of what you can do with the pandas Python library. You can power up your project with pandas tricks, learn techniques to speed up pandas in Python, and even dive deep to see how pandas works behind the scenes. There are many more features for you to discover, so get out there and tackle those datasets! You can get all the code examples you saw in this tutorial by clicking the link below:Get Jupyter Notebook: Click here to get the Jupyter Notebook you’ll use to explore data with Pandas in this tutorial.",
    "preview": false
  },
  {
    "id": 69,
    "title": "Invalid Syntax in Python: Common Reasons for SyntaxError",
    "url": "https://realpython.com/invalid-syntax-python/",
    "pub_date": "2019-11-20T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this step-by-step tutorial, you'll see common examples of invalid syntax in Python and learn how to resolve the issue. If you've ever received a SyntaxError when trying to run your Python code, then this is the guide for you!",
    "text": "Conclusion\n In this tutorial, you’ve seen what information the SyntaxError traceback gives you. You’ve also seen many common examples of invalid syntax in Python and what the solutions are to those problems. Not only will this speed up your workflow, but it will also make you a more helpful code reviewer!When you’re writing code, try to use an IDE that understands Python syntax and provides feedback. If you put many of the invalid Python code examples from this tutorial into a good IDE, then they should highlight the problem lines before you even get to execute your code.Getting a SyntaxError while you’re learning Python can be frustrating, but now you know how to understand traceback messages and what forms of invalid syntax in Python you might come up against. The next time you get a SyntaxError, you’ll be better equipped to fix the problem quickly!",
    "preview": false
  },
  {
    "id": 70,
    "title": "Getting Started With Python IDLE",
    "url": "https://realpython.com/python-idle/",
    "pub_date": "2019-11-13T14:00:00+00:00",
    "tags": [
      "basics"
    ],
    "description": "In this tutorial, you'll learn how to use the development environment included with your Python installation. Python IDLE is a small program that packs a big punch!  You'll learn how to use Python IDLE to interact with Python directly, work with Python files, and improve your development workflow.",
    "text": "Conclusion\n In this tutorial, you’ve learned all the basics of using IDLE to write Python programs. You know what Python IDLE is and how you can use it to interact with Python directly. You’ve also learned how to work with Python files and customize Python IDLE to your liking.You’ve learned how to:Now you’re armed with a new tool that will let you productively write Pythonic code and save you countless hours down the road. Happy programming!",
    "preview": false
  },
  {
    "id": 71,
    "title": "When to Use a List Comprehension in Python",
    "url": "https://realpython.com/list-comprehension-python/",
    "pub_date": "2019-11-06T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "Python list comprehensions make it easy to create lists while performing sophisticated filtering, mapping, and conditional logic on their members. In this tutorial, you'll learn when to use a list comprehension in Python and how to create them effectively.",
    "text": "Conclusion\n In this tutorial, you learned how to use a list comprehension in Python to accomplish complex tasks without making your code overly complicated.Now you can:Whenever you have to choose a list creation method, try multiple implementations and consider what’s easiest to read and understand in your specific scenario. If performance is important, then you can use profiling tools to give you actionable data instead of relying on hunches or guesses about what works the best.Remember that while Python list comprehensions get a lot of attention, your intuition and ability to use data when it counts will help you write clean code that serves the task at hand. This, ultimately, is the key to making your code Pythonic!",
    "preview": false
  },
  {
    "id": 72,
    "title": "Using the Python zip() Function for Parallel Iteration",
    "url": "https://realpython.com/python-zip-function/",
    "pub_date": "2019-10-02T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this step-by-step tutorial, you'll learn how to use the Python zip() function to solve common programming problems. You'll learn how to traverse multiple iterables in parallel and create dictionaries with just a few lines of code.",
    "text": "Conclusion\n In this tutorial, you’ve learned how to use Python’s zip() function. zip() can receive multiple iterables as input. It returns an iterator that can generate tuples with paired elements from each argument. The resulting iterator can be quite useful when you need to process multiple iterables in a single loop and perform some actions on their items at the same time.Now you can:You’ve also coded a few examples that you can use as a starting point for implementing your own solutions using Python’s zip() function. Feel free to modify these examples as you explore zip() in depth!",
    "preview": false
  },
  {
    "id": 73,
    "title": "How to Convert a Python String to int",
    "url": "https://realpython.com/convert-python-string-to-int/",
    "pub_date": "2019-09-18T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "There are several ways to represent integers in Python. In this quick and practical tutorial, you'll learn how you can store integers using int and str as well as how you can convert a Python string to an int and vice versa.",
    "text": "Conclusion\n Congratulations! You’ve learned so much about integers and how to represent and convert them between Python string and int data types.In this tutorial, you learned:Now that you know so much about str and int, you can learn more about representing numerical types using float(), hex(), oct(), and bin()!",
    "preview": false
  },
  {
    "id": 74,
    "title": "MATLAB vs Python: Why and How to Make the Switch",
    "url": "https://realpython.com/matlab-vs-python/",
    "pub_date": "2019-09-09T14:00:00+00:00",
    "tags": [
      "best-practices",
      "data-science",
      "basics"
    ],
    "description": "In this step-by-step tutorial, you'll learn about MATLAB vs Python, why you should switch from MATLAB to Python, the packages you'll need to make a smooth transition, and the bumps you'll most likely encounter along the way.",
    "text": "Further Reading\n There are tons of resources on the Web covering the differences in MATLAB vs Python. Here are a few of the resources that I found helpful when I transitioned from MATLAB to Python:",
    "preview": false
  },
  {
    "id": 75,
    "title": "An Effective Python Environment: Making Yourself at Home",
    "url": "https://realpython.com/effective-python-environment/",
    "pub_date": "2019-08-14T14:00:00+00:00",
    "tags": [
      "basics",
      "tools"
    ],
    "description": "This guide will walk you through the decisions you need to make when customizing your development environment for working with Python.",
    "text": "Conclusion\n You learned about many facets of the typical Python environment. Armed with this knowledge, you can:When you’ve got your Python environment just so, I hope you’ll share screenshots, screencasts, or blog posts about your perfect setup ✨",
    "preview": false
  },
  {
    "id": 76,
    "title": "Your Guide to the Python print() Function",
    "url": "https://realpython.com/python-print/",
    "pub_date": "2019-08-12T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this step-by-step tutorial, you'll learn about the print() function in Python and discover some of its lesser-known features. Avoid common mistakes, take your \"hello world\" to the next level, and know when to use a better alternative.",
    "text": "Conclusion\n You’re now armed with a body of knowledge about the print() function in Python, as well as many surrounding topics. You have a deep understanding of what it is and how it works, involving all of its key elements. Numerous examples gave you insight into its evolution from Python 2.Apart from that, you learned how to:Now that you know all this, you can make interactive programs that communicate with users or produce data in popular file formats. You’re able to quickly diagnose problems in your code and protect yourself from them. Last but not least, you know how to implement the classic snake game.If you’re still thirsty for more information, have questions, or simply would like to share your thoughts, then feel free to reach out in the comments section below.",
    "preview": false
  },
  {
    "id": 77,
    "title": "Understanding the Python Traceback",
    "url": "https://realpython.com/python-traceback/",
    "pub_date": "2019-07-29T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this step-by-step tutorial, you'll learn how to read and understand the information you can get from a Python traceback. You'll walk through several examples of tracebacks and see some of the most common tracebacks in Python.",
    "text": "Conclusion\n The Python traceback contains great information that can help you find what is going wrong in your Python code. These tracebacks can look a little intimidating, but once you break it down to see what it’s trying to show you, they can be super helpful. Going through a few tracebacks line by line will give you a better understanding of the information they contain and help you get the most out of them.Getting a Python traceback output when you run your code is an opportunity to improve your code. It’s one way Python tries to help you out.Now that you know how to read a Python traceback, you can benefit from learning more about some tools and techniques for diagnosing the problems that your traceback output is telling you about. Python’s built-in traceback module can be used to work with and inspect tracebacks. The traceback module can be helpful when you need to get more out of the traceback output. It would also be helpful to learn more about some techniques for debugging your Python code and ways to debug in IDLE.",
    "preview": false
  },
  {
    "id": 78,
    "title": "The Python Square Root Function",
    "url": "https://realpython.com/python-square-root-function/",
    "pub_date": "2019-07-08T14:00:00+00:00",
    "tags": [
      "basics"
    ],
    "description": "In this quick and practical tutorial, you'll learn what a square root is and how to calculate one in Python. You'll even see how you can use the Python square root function to solve a real-world problem.",
    "text": "Conclusion\n Congratulations! You now know all about the Python square root function.You’ve covered:Knowing how to use sqrt() is only half the battle. Understanding when to use it is the other. Now, you know both, so go and apply your newfound mastery of the Python square root function!",
    "preview": false
  },
  {
    "id": 79,
    "title": "Using the \"or\" Boolean Operator in Python",
    "url": "https://realpython.com/python-or-operator/",
    "pub_date": "2019-07-03T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this step-by-step tutorial, you'll learn how the Python \"or\" operator works and how to use it. You'll get to know its special features and see what kind of programming problems you can solve by using \"or\" in Python.",
    "text": "Conclusion\n You now know how the Python or operator works as well as how to use it for solving some common programming problems in Python. Now that you know the basics of the Python or operator, you’ll be able to:Use the Python or operator in Boolean and non-Boolean contextsSolve several kind of programming problems by effectively using the Python or operatorWrite better and more Pythonic code by taking advantage of the somewhat special features of or in PythonRead and better understand other people’s code when they make use of the Python or operatorIn addition, you’ve learned a little bit about Boolean logic, as well as some of its main concepts in Python.",
    "preview": false
  },
  {
    "id": 80,
    "title": "Basic Input, Output, and String Formatting in Python",
    "url": "https://realpython.com/python-input-output/",
    "pub_date": "2019-06-24T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this step-by-step Python tutorial, you'll learn how to take user input from the keyboard with the built-in function input(), how to display output to the console with the built-in function print(), and how to format string data with Python f-strings.",
    "text": "Python Input and Output: Conclusion\n In this tutorial, you learned about input and output in Python and how your Python program can communicate with the user. You’ve also explored some of the arguments you can work with to add a message to the input prompt or customize how Python displays the output back to your users.You’ve learned how to: In the following tutorial of this introductory series, you’ll learn about another string formatting technique, and you’ll dive deeper into using f-strings.",
    "preview": false
  },
  {
    "id": 81,
    "title": "How to Implement a Python Stack",
    "url": "https://realpython.com/how-to-implement-python-stack/",
    "pub_date": "2019-06-05T14:00:00+00:00",
    "tags": [
      "basics"
    ],
    "description": "In this tutorial, you'll learn how to implement a Python stack. You'll see how to recognize when a stack is a good choice for data structures, how to decide which implementation is best for a program, and what extra considerations to make about stacks in a threading or multiprocessing environment.",
    "text": "Conclusion\n You now know what a stack is and have seen situations where they can be used in real-life programs. You’ve evaluated three different options for implementing stacks and seen that deque is a great choice for non-threaded programs. If you’re implementing a stack in a threading environment, then it’s likely a good idea to use a LifoQueue.You are now able to:If you still have questions, feel free to reach out in the comments sections below. Now, go write some code since you gained another tool to help you solve your programming problems!",
    "preview": false
  },
  {
    "id": 82,
    "title": "Playing and Recording Sound in Python",
    "url": "https://realpython.com/playing-and-recording-sound-python/",
    "pub_date": "2019-05-13T14:00:00+00:00",
    "tags": [
      "basics"
    ],
    "description": "In this tutorial, you'll learn about libraries that can be used for playing and recording sound in Python, such as PyAudio and python-sounddevice. You'll also see code snippets for playing and recording sound files and arrays, as well as for converting between different sound file formats.",
    "text": "Conclusion: Playing and Recording Sound in Python\n In this tutorial, you learned how to use some of the most popular audio libraries to play and record audio in Python. You also saw how to save your audio in a range of different formats.You are now able to:You now have the information you need to help you decide which libraries to use to start working with audio in Python. Go forth, and develop some awesome audio applications!",
    "preview": false
  },
  {
    "id": 83,
    "title": "How to Use sorted() and sort() in Python",
    "url": "https://realpython.com/python-sort/",
    "pub_date": "2019-05-06T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this step-by-step tutorial, you’ll learn how to sort in Python. You'll know how to sort various types of data in different data structures, customize the order, and work with two different ways of sorting in Python.",
    "text": "How to Sort in Python: Conclusion\n .sort() and sorted() can provide exactly the sort order you need if you use them properly with both the reverse and key optional keyword arguments. Both have very different characteristics when it comes to output and in-place modifications, so make sure you think through any application functionality or program that will be using .sort() as it can irrevocably overwrite data. For the avid Pythonistas looking for a challenge with sorting, try using more complex data types in sorting: nested iterables. Also, feel free to dive into the open source Python code implementations for the built-ins and read about the sort algorithm used in Python called Timsort. And if you’re looking to sort dictionaries, then check out Sorting a Python Dictionary: Values, Keys, and More.",
    "preview": false
  },
  {
    "id": 84,
    "title": "Python KeyError Exceptions and How to Handle Them",
    "url": "https://realpython.com/python-keyerror/",
    "pub_date": "2019-04-24T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this tutorial, you'll learn how to handle Python KeyError exceptions. They are often caused by a bad key lookup in a dictionary, but there are a few other situations when a KeyError can be raised as well. Knowing how to handle these exceptions is essential to writing good Python code.",
    "text": "Conclusion\n You now know some common places where Python’s KeyError exception could be raised and some great solutions you could use to prevent them from stopping your program.Now, the next time you see a KeyError raised, you will know that it is probably just a bad dictionary key lookup. You will also be able to find all the information you need to determine where the error is coming from by looking at the last few lines of the traceback.If the problem is a dictionary key lookup in your own code, then you can switch from accessing the key directly on the dictionary to using the safer .get() method with a default return value. If the problem isn’t coming from your own code, then using the try except block is your best bet for controlling your code’s flow.Exceptions don’t have to be scary. Once you know how to understand the information provided to you in their tracebacks and the root cause of the exception, then you can use these solutions to make your programs flow more predictably.",
    "preview": false
  },
  {
    "id": 85,
    "title": "How to Run Your Python Scripts",
    "url": "https://realpython.com/run-python-scripts/",
    "pub_date": "2019-02-18T06:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "This step-by-step tutorial will guide you through a series of ways to run Python scripts, depending on your environment, platform, needs, and skills as a programmer.",
    "text": "Conclusion\n With the reading of this tutorial, you have acquired the knowledge and skills you need to be able to run Python scripts and code in several ways and in a variety of situations and development environments.You are now able to run Python scripts from:These skills will make your development process much faster, as well as more productive and flexible. Take the Quiz: Test your knowledge with our interactive “How to Run Your Python Scripts” quiz. Upon completion you will receive a score so you can track your learning progress over time:",
    "preview": false
  },
  {
    "id": 86,
    "title": "Python \"for\" Loops (Definite Iteration)",
    "url": "https://realpython.com/python-for-loop/",
    "pub_date": "2019-01-30T06:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this introductory tutorial, you'll learn all about how to perform definite iteration with Python for loops. You’ll see how other programming languages implement definite iteration, learn about iterables and iterators, and tie it all together to learn about Python’s for loop.",
    "text": "Conclusion\n This tutorial presented the for loop, the workhorse of definite iteration in Python.You also learned about the inner workings of iterables and iterators, two important object types that underlie definite iteration, but also figure prominently in a wide variety of other Python code.In the next two tutorials in this introductory series, you will shift gears a little and explore how Python programs can interact with the user via input from the keyboard and output to the console.",
    "preview": false
  },
  {
    "id": 87,
    "title": "Working With Files in Python",
    "url": "https://realpython.com/working-with-files-in-python/",
    "pub_date": "2019-01-21T06:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this tutorial, you'll learn how you can work with files in Python by using built-in modules to perform practical tasks that involve groups of files, like renaming them, moving them around, archiving them, and getting their metadata.",
    "text": "Conclusion\n You now know how to use Python to perform the most common operations on files and groups of files. You’ve learned about the different built-in modules used to read, find, and manipulate them.You’re now equipped to use Python to:",
    "preview": false
  },
  {
    "id": 88,
    "title": "Django Migrations: A Primer",
    "url": "https://realpython.com/django-migrations-a-primer/",
    "pub_date": "2019-01-09T12:10:21+00:00",
    "tags": [
      "databases",
      "web-dev",
      "basics",
      "django"
    ],
    "description": "In this tutorial, you’ll get comfortable with Django migrations and learn how to create database tables without writing any SQL, how to automatically modify your database after you changed your models, and how to revert changes made to your database.",
    "text": "Conclusion\n You covered quite a bit of ground in this tutorial and learned the fundamentals of Django migrations.To recap, the basic steps to use Django migrations look like this:That’s it! This workflow will work the majority of the time, but if things don’t work out as expected, you also know how to list and unapply migrations.If you previously created and modified your database tables with hand-written SQL, you have now become much more efficient by delegating this work to Django migrations.In the next tutorial in this series, you will dig deeper into the topic and learn how Django Migrations work under the hood.Free Bonus: Click here to get access to a free Django Learning Resources Guide (PDF) that shows you tips and tricks as well as common pitfalls to avoid when building Python + Django web applications.Cheers!",
    "preview": false
  },
  {
    "id": 89,
    "title": "Thonny: The Beginner-Friendly Python Editor",
    "url": "https://realpython.com/python-thonny/",
    "pub_date": "2018-12-12T14:00:00+00:00",
    "tags": [
      "basics",
      "tools"
    ],
    "description": "In this tutorial, you’ll learn all about Thonny, a free Python Integrated Development Environment (IDE) that was especially designed with the beginner Pythonista in mind. It has a built-in debugger and allows you to do step-through expression evaluation.",
    "text": "Conclusion\n Awesome job getting through this tutorial on Thonny!You can now start using Thonny to write, debug, and run Python code! If you like Thonny, you might also like some of the other IDEs we’ve listed in Python IDEs and Code Editors (Guide).Thonny is actively maintained, and new features are being added all the time. There are several awesome new features that are currently in beta that can be found on the Thonny Blog. Thonny’s main development takes place at the Institute of Computer Science of the University of Tartu, Estonia, as well as by contributors around the world.",
    "preview": false
  },
  {
    "id": 90,
    "title": "Python \"while\" Loops (Indefinite Iteration)",
    "url": "https://realpython.com/python-while-loop/",
    "pub_date": "2018-11-07T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this tutorial, you'll learn about indefinite iteration using the Python while loop. You’ll be able to construct basic and complex while loops, interrupt loop execution with break and continue, use the else clause with a while loop, and deal with infinite loops.",
    "text": "Conclusion\n In this tutorial, you learned about indefinite iteration using the Python while loop.  You’re now able to:You should now have a good grasp of how to execute a piece of code repetitively. Take the Quiz: Test your knowledge with our interactive “Python \"while\" Loops” quiz. Upon completion you will receive a score so you can track your learning progress over time:The next tutorial in this series covers definite iteration with for loops—recurrent execution where the number of repetitions is specified explicitly.",
    "preview": false
  },
  {
    "id": 91,
    "title": "Writing Comments in Python (Guide)",
    "url": "https://realpython.com/python-comments-guide/",
    "pub_date": "2018-11-05T14:00:00+00:00",
    "tags": [
      "best-practices",
      "basics"
    ],
    "description": "Learn how to write Python comments that are clean, concise, and useful. Quickly get up to speed on what the best practices are, which types of comments it's best to avoid, and how you can practice writing cleaner comments.",
    "text": "Conclusion\n Learning to comment well is a valuable tool. Not only will you learn how to write more clearly and concisely in general, but you’ll no doubt gain a deeper understanding of Python as well.Knowing how to write comments in Python can make life easier for all developers, including yourself! They can help other devs get up to speed on what your code does, and help you get re-acquainted with old code of your own.By noticing when you’re using comments to try and support poorly written code, you’ll be able to go back and modify your code to be more robust. Commenting previously written code, whether your own or another developer’s, is a great way to practice writing clean comments in Python.As you learn more about documenting your code, you can consider moving on to the next level of documentation. Check out our tutorial on Documenting Python Code to take the next step.",
    "preview": false
  },
  {
    "id": 92,
    "title": "Setting Up Python for Machine Learning on Windows",
    "url": "https://realpython.com/python-windows-machine-learning-setup/",
    "pub_date": "2018-10-31T14:00:00+00:00",
    "tags": [
      "machine-learning",
      "data-science",
      "basics"
    ],
    "description": "In this step-by-step tutorial, you’ll cover the basics of setting up a Python numerical computation environment for machine learning on a Windows machine using the Anaconda Python distribution.",
    "text": "Where To Go From Here\n Data science and machine learning applications are emerging in the most diverse areas, attracting more people. However, setting up an environment for numerical computation can be a complicated task, and it’s common to find users having trouble in data science workshops, especially when using Windows.In this article, you’ve covered the basics of setting up a Python numerical computation environment on a Windows machine using the Anaconda Python distribution.Free Bonus: Click here to get access to a Conda cheat sheet with handy usage examples for managing your Python environment and packages.Now that you have a working environment, it’s time to start working with some applications. Python is one of the most used languages for data science and machine learning, and Anaconda is one of the most popular distributions, used in various companies and research laboratories. It provides several packages to install libraries that Python relies on for data acquisition, wrangling, processing, and visualization.Fortunately there are a lot of tutorials about these libraries available at Real Python, including the following:Also, if you’d like a deeper understanding of Anaconda and Conda, check out the following links:",
    "preview": false
  },
  {
    "id": 93,
    "title": "The Python range() Function (Guide)",
    "url": "https://realpython.com/python-range/",
    "pub_date": "2018-10-15T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "Master the Python range() function, learn how its implementation differs in Python 3 vs 2, and see how you can use it to write faster and more Pythonic code.",
    "text": "Go Forth and Loop\n You now understand how to use range() and work around its limitations. You also have an idea of how this important function has evolved between Python 2 and Python 3.The next time you need to perform an action a specific number of times, you’ll be all set to loop your heart out!Happy Pythoning!",
    "preview": false
  },
  {
    "id": 94,
    "title": "Splitting, Concatenating, and Joining Strings in Python",
    "url": "https://realpython.com/python-string-split-concatenate-join/",
    "pub_date": "2018-10-01T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this beginner-friendly article, you’ll learn some of the most fundamental string operations: splitting, concatenating, and joining. Not only will you learn how to use these tools, but you’ll walk away with a deeper understanding of how they work under the hood in Python.",
    "text": "Tying It All Together\n While this concludes this overview of the most basic string operations in Python (splitting, concatenating, and joining), there is still a whole universe of string methods that can make your experiences with manipulating strings much easier. Once you have mastered these basic string operations, you may want to learn more. Luckily, we have a number of great tutorials to help you complete your mastery of Python’s features that enable smart string manipulation: Take the Quiz: Test your knowledge with our interactive “Splitting, Concatenating, and Joining Strings in Python” quiz. Upon completion you will receive a score so you can track your learning progress over time:",
    "preview": false
  },
  {
    "id": 95,
    "title": "The Best Python Books",
    "url": "https://realpython.com/best-python-books/",
    "pub_date": "2018-09-10T14:00:00+00:00",
    "tags": [
      "intermediate",
      "basics",
      "community"
    ],
    "description": "Find the right books to help you get started with Python or take your coding to the next level with this detailed guide to the best Python books out there.",
    "text": "Get Coding!\n One of the awesome things about Python is it has a relatively low barrier to entry, compared to many other languages.\nDespite this, learning Python is a never-ending process.\nThe language is relevant for such a wide variety of tasks, and evolves so much that there will always be something new to discover and learn.\nWhile you can pick up enough Python to do some fun things in a week or two, people who’ve been using Python for twenty years will tell you they’re still learning new things they can do with this flexible and evolving language.To ultimately be successful as a Python programmer, you need to begin with a solid foundation, then gain a deeper understanding of how the language works, and how to best put it to use.\nTo gain a solid foundation, you really can’t go wrong with any of the best books to learn Python.\nIf you want to learn Python with a child, or maybe teach a group of kids, check out the list of best Python books for kids.\nAfter you’ve got your feet wet, check out some of the best intermediate and advanced Python books to dig in deeper to less obvious concepts that will improve the efficiency of your code.All of these books will teach you what you need to know to legitimately call yourself a Python coder.\nThe only ingredient missing is you.",
    "preview": false
  },
  {
    "id": 96,
    "title": "Conditional Statements in Python",
    "url": "https://realpython.com/python-conditional-statements/",
    "pub_date": "2018-09-05T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this step-by-step tutorial you'll learn how to work with conditional (\"if\") statements in Python. Master if-statements and see how to write complex decision making code in your programs.",
    "text": "Conclusion\n With the completion of this tutorial, you are beginning to write Python code that goes beyond simple sequential execution:All of these concepts are crucial to developing more complex Python code.The next two tutorials will present two new control structures:  the while statement and the for statement.  These structures facilitate iteration, execution of a statement or block of statements repeatedly. Take the Quiz: Test your knowledge with our interactive “Python Conditional Statements” quiz. Upon completion you will receive a score so you can track your learning progress over time:",
    "preview": false
  },
  {
    "id": 97,
    "title": "Python Program Lexical Structure",
    "url": "https://realpython.com/python-program-structure/",
    "pub_date": "2018-09-03T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this tutorial you'll dig deeper into Python's lexical structure and start arranging code into more complex groupings. You'll learn about the syntactic elements that comprise statements, the basic units that make up a Python program.",
    "text": "Conclusion\n This tutorial introduced you to Python program lexical structure.  You learned what constitutes a valid Python statement and how to use implicit and explicit line continuation to write a statement that spans multiple lines.  You also learned about commenting Python code, and about use of whitespace to enhance readability.Next, you will learn how to group statements into more complex decision-making constructs using conditional statements. Take the Quiz: Test your knowledge with our interactive “Python Program Structure” quiz. Upon completion you will receive a score so you can track your learning progress over time:",
    "preview": false
  },
  {
    "id": 98,
    "title": "Sets in Python",
    "url": "https://realpython.com/python-sets/",
    "pub_date": "2018-08-20T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this tutorial you'll learn how to work effectively with Python's set data type. You'll see how to define set objects in Python and discover the operations that they support and by the end of the tutorial you'll have a good feel for when a set is an appropriate choice in your own programs.",
    "text": "Conclusion\n In this tutorial, you learned how to define set objects in Python, and you became familiar with the functions, operators, and methods that can be used to work with sets.You should now be comfortable with the basic built-in data types that Python provides.Next, you will begin to explore how the code that operates on those objects is organized and structured in a Python program. Take the Quiz: Test your knowledge with our interactive “Python Sets” quiz. Upon completion you will receive a score so you can track your learning progress over time:",
    "preview": false
  },
  {
    "id": 99,
    "title": "Dictionaries in Python",
    "url": "https://realpython.com/python-dicts/",
    "pub_date": "2018-08-06T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this Python dictionaries tutorial, you'll cover the basic characteristics and learn how to access and manage dictionary data. Once you have finished this tutorial, you should have a good sense of when a dictionary is the appropriate data type to use, and how to do so.",
    "text": "Conclusion\n In this tutorial, you covered the basic properties of the Python dictionary and learned how to access and manipulate dictionary data.Lists and dictionaries are two of the most frequently used Python types.  As you have seen, they have several similarities, but differ in how their elements are accessed.  Lists elements are accessed by numerical index based on order, and dictionary elements are accessed by keyBecause of this difference, lists and dictionaries tend to be appropriate for different circumstances.  You should now have a good feel for which, if either, would be best for a given situation.Next you will learn about Python sets.  The set is another composite data type, but it is quite different from either a list or dictionary. Take the Quiz: Test your knowledge with our interactive “Python Dictionaries” quiz. Upon completion you will receive a score so you can track your learning progress over time:",
    "preview": false
  },
  {
    "id": 100,
    "title": "Lists and Tuples in Python",
    "url": "https://realpython.com/python-lists-tuples/",
    "pub_date": "2018-07-18T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "You'll cover the important characteristics of lists and tuples in Python 3. You'll learn how to define them and how to manipulate them. When you're finished, you should have a good feel for when and how to use these object types in a Python program.",
    "text": "Conclusion\n This tutorial covered the basic properties of Python lists and tuples, and how to manipulate them.  You will use these extensively in your Python programming.One of the chief characteristics of a list is that it is ordered.  The order of the elements in a list is an intrinsic property of that list and does not change, unless the list itself is modified.  (The same is true of tuples, except of course they can’t be modified.)The next tutorial will introduce you to the Python dictionary: a composite data type that is unordered.  Read on! Take the Quiz: Test your knowledge with our interactive “Python Lists and Tuples” quiz. Upon completion you will receive a score so you can track your learning progress over time:",
    "preview": false
  },
  {
    "id": 101,
    "title": "Strings and Character Data in Python",
    "url": "https://realpython.com/python-strings/",
    "pub_date": "2018-07-09T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this tutorial you'll learn how to use Python's rich set of operators, functions, and methods for working with strings. You'll learn how to access and extract portions of strings, and also become familiar with the methods that are available to manipulate and modify string data in Python 3.",
    "text": "Conclusion\n This tutorial provided an in-depth look at the many different mechanisms Python provides for string handling, including string operators, built-in functions, indexing, slicing, and built-in methods. You also were introduced to the bytes and bytearray types.These types are the first types you have examined that are composite—built from a collection of smaller parts.  Python provides several composite built-in types.  In the next tutorial, you will explore two of the most frequently used:  lists and tuples. Take the Quiz: Test your knowledge with our interactive “Python Strings and Character Data” quiz. Upon completion you will receive a score so you can track your learning progress over time:",
    "preview": false
  },
  {
    "id": 102,
    "title": "Python String Formatting Best Practices",
    "url": "https://realpython.com/python-string-formatting/",
    "pub_date": "2018-07-04T14:00:00+00:00",
    "tags": [
      "python",
      "best-practices",
      "basics"
    ],
    "description": "Learn the four main approaches to string formatting in Python, as well as their strengths and weaknesses. You'll also get a simple rule of thumb for how to pick the best general purpose string formatting approach in your own programs.",
    "text": "Which String Formatting Method Should You Use?\n I totally get that having so much choice for how to format your strings in Python can feel very confusing. This is an excellent cue to bust out this handy flowchart infographic I’ve put together for you:This flowchart is based on the rule of thumb that I apply when I’m writing Python:Python String Formatting Rule of Thumb: If your format strings are user-supplied, use Template Strings (#4) to avoid security issues. Otherwise, use Literal String Interpolation/f-Strings (#3) if you’re on Python 3.6+, and “New Style” str.format (#2) if you’re not.",
    "preview": false
  },
  {
    "id": 103,
    "title": "Python Histogram Plotting: NumPy, Matplotlib, pandas & Seaborn",
    "url": "https://realpython.com/python-histograms/",
    "pub_date": "2018-07-02T14:00:00+00:00",
    "tags": [
      "data-science",
      "basics"
    ],
    "description": "In this tutorial, you'll be equipped to make production-quality, presentation-ready Python histogram plots with a range of choices and features. It's your one-stop shop for constructing & manipulating histograms with Python's scientific stack.",
    "text": "Alright, So Which Should I Use?\n At this point, you’ve seen more than a handful of functions and methods to choose from for plotting a Python histogram.  How do they compare?  In short, there is no “one-size-fits-all.”  Here’s a recap of the functions and methods you’ve covered thus far, all of which relate to breaking down and representing distributions in Python:Free Bonus: Short on time? Click here to get access to a free two-page Python histograms cheat sheet that summarizes the techniques explained in this tutorial.You can also find the code snippets from this article together in one script at the Real Python materials page.With that, good luck creating histograms in the wild.  Hopefully one of the tools above will suit your needs.  Whatever you do, just don’t use a pie chart.",
    "preview": false
  },
  {
    "id": 104,
    "title": "Operators and Expressions in Python",
    "url": "https://realpython.com/python-operators-expressions/",
    "pub_date": "2018-06-20T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "You'll see how calculations can be performed on objects in Python. By the end of this tutorial, you will be able to create complex expressions by combining Python objects and operators.",
    "text": "Conclusion\n In this tutorial, you learned about the diverse operators Python supports to combine objects into expressions.Most of the examples you have seen so far have involved only simple atomic data, but you saw a brief introduction to the string data type.  The next tutorial will explore string objects in much more detail. Take the Quiz: Test your knowledge with our interactive “Python Operators and Expressions” quiz. Upon completion you will receive a score so you can track your learning progress over time:",
    "preview": false
  },
  {
    "id": 105,
    "title": "Variables in Python",
    "url": "https://realpython.com/python-variables/",
    "pub_date": "2018-06-12T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "Learn how every item of data in a Python program can be described by the abstract term \"object,\" and how to manipulate objects using symbolic names called \"variables.\"",
    "text": "Conclusion\n This tutorial covered the basics of Python variables, including object references and identity, and naming of Python identifiers.You now have a good understanding of some of Python’s data types and know how to create variables that reference objects of those types.Next, you will see how to combine data objects into expressions involving various operations. Take the Quiz: Test your knowledge with our interactive “Python Variables” quiz. Upon completion you will receive a score so you can track your learning progress over time:",
    "preview": false
  },
  {
    "id": 106,
    "title": "Basic Data Types in Python",
    "url": "https://realpython.com/python-data-types/",
    "pub_date": "2018-06-05T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "Learn the basic data types that are built into Python, like numbers, strings, and Booleans. You'll also get an overview of Python's built-in functions.",
    "text": "Conclusion\n In this tutorial, you learned about the built-in data types and functions Python provides.The examples given so far have all manipulated and displayed only constant values.  In most programs, you are usually going to want to create objects that change in value as the program executes.Head to the next tutorial to learn about Python variables. Take the Quiz: Test your knowledge with our interactive “Basic Data Types in Python” quiz. Upon completion you will receive a score so you can track your learning progress over time:",
    "preview": false
  },
  {
    "id": 107,
    "title": "Python Application Layouts: A Reference",
    "url": "https://realpython.com/python-application-layouts/",
    "pub_date": "2018-06-04T14:00:00+00:00",
    "tags": [
      "best-practices",
      "basics"
    ],
    "description": "A reference guide to common Python application layouts and project structures for command-line applications, web applications, and more.",
    "text": "Conclusions and Reminders\n Now you’ve seen example layouts for a number of different application types: one-off Python scripts, installable single packages, larger applications with internal packages, Django web applications, and Flask web applications. Coming away from this guide, you will have the tools to successfully prevent coder’s block by building out your application structure so that you’re not staring at a blank canvas trying to figure out where to start. Because Python is largely non-opinionated when it comes to application layouts, you can customize these example layouts to your heart’s content to better fit your use case. I want you to not only have an application layout reference but also come away with the understanding that these examples are neither hard-and-fast rules nor the only way to structure your application. Over time and with practice, you’ll develop the ability to build and customize your own useful Python application layouts.Did I miss a use case? Do you have another application structure philosophy? Did this article help prevent coder’s block? Let me know in the comments!",
    "preview": false
  },
  {
    "id": 108,
    "title": "Interacting With Python",
    "url": "https://realpython.com/interacting-with-python/",
    "pub_date": "2018-05-28T14:00:00+00:00",
    "tags": [
      "basics"
    ],
    "description": "How to actually execute Python code and run Python programs using the CPython REPL, executing script files, and integrated development environments.",
    "text": "Conclusion\n Larger applications are typically contained in script files that are passed to the Python interpreter for execution.But one of the advantages of an interpreted language is that you can run the interpreter and execute commands interactively.  Python is easy to use in this manner, and it is a great way to get your feet wet learning how the language works.The examples throughout this tutorial have been produced by direct interaction with the Python interpreter, but if you choose to use IDLE or some other available IDE, the examples should still work just fine.Continue to the next section, where you will start to explore the elements of the Python language itself.",
    "preview": false
  },
  {
    "id": 109,
    "title": "Introduction to Python 3",
    "url": "https://realpython.com/python-introduction/",
    "pub_date": "2018-05-21T14:00:00+00:00",
    "tags": [
      "basics"
    ],
    "description": "An overview of the Python programming language, including a brief history of the development of Python\r\nand reasons why you might select Python as your language of choice.",
    "text": "Conclusion\n This section gave an overview of the Python programming language, including:Python is a great option, whether you are a beginning programmer looking to learn the basics, an experienced programmer designing a large application, or anywhere in between.  The basics of Python are easily grasped, and yet its capabilities are vast.Proceed to the next section to learn how to acquire and install Python on your computer.",
    "preview": false
  },
  {
    "id": 110,
    "title": "Python 3's f-Strings: An Improved String Formatting Syntax (Guide)",
    "url": "https://realpython.com/python-f-strings/",
    "pub_date": "2018-05-14T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "As of Python 3.6, f-strings are a great new way to format strings. Not only are they more readable, more concise, and less prone to error than other ways of formatting, but they are also faster! By the end of this article, you will learn how and why to start using f-strings today.",
    "text": "Further Reading\n If you’d like to read an extended discussion about string interpolation, take a look at PEP 502. Also, the PEP 536 draft has some more thoughts about the future of f-strings.Free PDF Download: Python 3 Cheat SheetFor more fun with strings, check out the following articles:Happy Pythoning! Take the Quiz: Test your knowledge with our interactive “Python f-Strings” quiz. Upon completion you will receive a score so you can track your learning progress over time:",
    "preview": false
  },
  {
    "id": 111,
    "title": "Python Exceptions: An Introduction",
    "url": "https://realpython.com/python-exceptions/",
    "pub_date": "2018-04-30T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "In this beginner tutorial you'll learn what exceptions are good for in Python. You'll see how to raise exceptions and how to handle them with \"try/except\" blocks.",
    "text": "Summing Up\n After seeing the difference between syntax errors and exceptions, you learned about various ways to raise, catch, and handle exceptions in Python. In this article, you saw the following options:Free PDF Download: Python 3 Cheat SheetHopefully, this article helped you understand the basic tools that Python has to offer when dealing with exceptions.",
    "preview": false
  },
  {
    "id": 112,
    "title": "Python Modules and Packages – An Introduction",
    "url": "https://realpython.com/python-modules-packages/",
    "pub_date": "2018-04-17T14:00:00+00:00",
    "tags": [
      "python",
      "basics"
    ],
    "description": "This article explores Python modules and Python packages, two mechanisms that facilitate modular programming.",
    "text": "Conclusion\n In this tutorial, you covered the following topics:Free PDF Download: Python 3 Cheat SheetThis will hopefully allow you to better understand how to gain access to the functionality available in the many third-party and built-in modules available in Python.Additionally, if you are developing your own application, creating your own  modules and packages will help you organize and modularize your code, which makes coding, maintenance, and debugging easier.If you want to learn more, check out the following documentation at Python.org:Happy Pythoning!",
    "preview": false
  },
  {
    "id": 113,
    "title": "Introduction to Git and GitHub for Python Developers",
    "url": "https://realpython.com/python-git-github-intro/",
    "pub_date": "2018-04-04T14:00:00+00:00",
    "tags": [
      "basics",
      "tools"
    ],
    "description": "What is Git,  what is GitHub, and what's the difference? Learn the basics of Git and GitHub from the perspective of a Pythonista in this tutorial.",
    "text": "Putting It All Together: Simple Git Workflow\n At this point, we’ve reviewed several basic Git commands and how you might use them. I’ll wrap up with a quick description of a possible workflow in Git. This workflow assumes you are working on your local repo and have a remote repo to which you will push changes. It can be GitHub, but it will work the same with other remote repos. It assumes you’ve already cloned the repo.This is one of the more basic flows through the system. There are many, many ways to use Git, and you’ve just scratched the surface with this tutorial. If you use Vim or Sublime as your editor, you might want to checkout these tutorials, which will show you how to get plugins to integrate Git into your editor:If you’d like to take a deeper dive into Git, I can recommend these books:Finally, if you’re interested in harnessing the power of artificial intelligence in your coding journey, then you might want to play around with GitHub Copilot.",
    "preview": false
  },
  {
    "id": 114,
    "title": "11 Beginner Tips for Learning Python Programming",
    "url": "https://realpython.com/python-beginner-tips/",
    "pub_date": "2018-04-03T14:00:00+00:00",
    "tags": [
      "basics"
    ],
    "description": "In this article, you'll see several learning strategies and tips that will help jump start your journey of becoming a rockstar Python programmer.",
    "text": "Go Forth and Learn!\n Now that you have these strategies for learning, you are ready to begin your Python journey! Find Real Python’s Beginners Roadmap for Learning here! We also offer a beginner’s level Python course, which uses interesting examples to help you learn programming and web development.Happy Coding!",
    "preview": false
  },
  {
    "id": 115,
    "title": "Python IDEs and Code Editors (Guide)",
    "url": "https://realpython.com/python-ides-code-editors-guide/",
    "pub_date": "2018-03-13T21:40:51+00:00",
    "tags": [
      "basics",
      "tools"
    ],
    "description": "Find your perfect Python development setup with this review of Python IDEs and code editors, including recommendations and screen shots.",
    "text": "Which Python IDE is Right for You?\n Only you can decide that, but here are some basic recommendations:",
    "preview": false
  },
  {
    "id": 116,
    "title": "Python Project for Beginners: Bitcoin Price Notifications",
    "url": "https://realpython.com/python-bitcoin-ifttt/",
    "pub_date": "2018-03-08T07:00:00+00:00",
    "tags": [
      "web-dev",
      "basics",
      "projects"
    ],
    "description": "Build your own Bitcoin price notification service with Python and IFTTT. This tutorial is a project-based exercise for beginners looking to improve their Python coding skills by building a small real-world app.",
    "text": "Recap and Next Steps\n In this article, we created our very own Bitcoin notification service. You learned how to send HTTP GET and POST requests using the requests package. You saw how easy it was to connect your Python app to external services using IFTTT and webhooks.Now, where should you go next? With Python and IFTTT the sky is the limit. But here are some suggestions that can get you started:Also, this will be an ongoing series with more Python projects you can build to grow your skills. Don’t miss out on the next tutorial:Get Notified: Don’t miss the follow up to this tutorial—Click here to join the Real Python Newsletter and you’ll know when the next installment comes out.Good luck and Happy Pythoning! Let me know what you’ve built using Python and IFTTT in the comments below!",
    "preview": false
  },
  {
    "id": 117,
    "title": "Python Plotting With Matplotlib (Guide)",
    "url": "https://realpython.com/python-matplotlib-guide/",
    "pub_date": "2018-02-28T14:00:00+00:00",
    "tags": [
      "data-science",
      "basics"
    ],
    "description": "This article is a beginner-to-intermediate-level walkthrough on Python and matplotlib that mixes theory with example.",
    "text": "Appendix B: Interactive Mode\n Behind the scenes, matplotlib also interacts with different backends.  A backend is the workhorse behind actually rendering a chart.  (On the popular Anaconda distribution, for instance, the default backend is Qt5Agg.)  Some backends are interactive, meaning they are dynamically updated and “pop up” to the user when changed.While interactive mode is off by default, you can check its status with plt.rcParams['interactive'] or plt.isinteractive(), and toggle it on and off with plt.ion() and plt.ioff(), respectively:In some code examples, you may notice the presence of plt.show() at the end of a chunk of code.  The main purpose of plt.show(), as the name implies, is to actually “show” (open) the figure when you’re running with interactive mode turned off.  In other words:Below, we make sure that interactive mode is off, which requires that we call plt.show() after building the plot itself:Notably, interactive mode has nothing to do with what IDE you’re using, or whether you’ve enable inline plotting with something like jupyter notebook --matplotlib inline or %matplotlib.",
    "preview": false
  },
  {
    "id": 118,
    "title": "Python Programming Challenge – First to Five",
    "url": "https://realpython.com/python-programming-contest-first-to-five/",
    "pub_date": "2015-09-21T13:47:22+00:00",
    "tags": [
      "community",
      "basics"
    ],
    "description": "Come take part in a programming challenge to test your logic skills and abilities.",
    "text": "Grading\n The grading is simple: We’ll run each strategy through the random number generator 100 times as a first screen - return random.randrange(1, 10). The strategies that beat the generator we’ll then be ran against one other in a round robin format to determine the overall winners. Be sure to test your code out in the game runner before submitting.To submit your script, just email us a link to a secret Gist - info (at) realpython (dot) com. Good luck!This contest is now closed. Thanks to everyone who participated, and Happy Pythoning!",
    "preview": false
  },
  {
    "id": 119,
    "title": "Scaffold a Flask Project",
    "url": "https://realpython.com/scaffold-a-flask-project/",
    "pub_date": "2015-04-27T13:52:16+00:00",
    "tags": [
      "web-dev",
      "basics",
      "flask"
    ],
    "description": "This article details how to build a scaffolding tool used to generate a Flask boilerplate.",
    "text": "Conclusion\n What do you think? Did we miss anything? What other arguments would you add to argparse in order to customize your scaffold script even further? Comment below!Grab the final code from the repo.",
    "preview": false
  },
  {
    "id": 120,
    "title": "Analyzing Obesity in England With Python",
    "url": "https://realpython.com/analyzing-obesity-in-england-with-python/",
    "pub_date": "2015-03-13T13:36:19+00:00",
    "tags": [
      "data-science",
      "basics"
    ],
    "description": "Let's look at using Python and Pandas to perform data analysis on obesity in England.",
    "text": "But what about the future?\n The graph still doesn’t tell us what will happen to children’s obesity in the future. There are ways to extrapolate graphs like these into the future, but I must give a warning before we proceed: The obesity data has no underlying mathematical foundation. That is, we can’t find a formula that will predict how these values will change in the future. Everything is essentially guesswork. With this warning in mind, let’s see how we can try to extrapolate our graph.First, Scipy does provide a function for extrapolation, but it only works for monotically increasing data (while our data goes up and down).We can try curve fitting:We’ll use these two functions together to try and predict the future for England’s children:Here, we extract the values for children under 16. For the x axis, the original graph had dates. To simplify our graph, we’ll just be using the the numbers 0-10.Output:One more thing: Curve fitting uses different degrees of polynomials. In very simple terms,the higher the degree, the more accurate the curve fitting will be, but there is also the chance that the results will be garbage. Scipy will sometimes warn you if the degree is too high. Don’t worry, this will be more clear when we look at some examples.We set the polynomial degree to 3. We then use the Numpy polyfit() function to try to fit a graph through the data we have. The poly1d() function is then called on the equation we generated to create a function that will be used to generate our values. This returns a function called poly_interp that we will use below:We loop from 0 to 10, and call the poly_interp() function on each value. Remember, this is the function we generated when we ran the curve fitting algorithm.Before moving on, let’s see what the different polynomial degrees mean.We will plot both the original data, and our own data, to see how close our equation reached the ideal data:The original data will be plotted in blue and labelled Orig, while the generated data will be red and labelled Fitted.With a polynomial value of 3:We see it isn’t that good a fit, so let’s try 5:Much better. What about 7?Now we get an almost perfect match. So, why wouldn’t we always use higher values?Because the higher values have been so tightly coupled to this graph, they make prediction useless. If we try to extrapolate from the graph above, we get garbage values. Trying different values, I found that polynomial degrees of 3 and 4 were the only ones that give accurate results, so that’s what we’ll be using.We are going to re-run our poly_interp() function, this time for values from 0-15, to predict five years into the future.This is the same code as before. Let’s again see the results with polynomial degrees of 3 and 4. The new extrapolated line is the green one and shows our prediction.With 3:Here, the obesity is going down. How about 4?But here, it is shooting up, so kids will end up weighing like tractors!Which of the two graphs is correct? It depends on whether you are working for the government or the opposition.This is actually a feature, not bug. You must have heard these political debates where two sides draw the exact opposite conclusions from the same data? Now you see how it’s possible to draw radically different conclusions by tweaking small parameters.And that is the reason we must be careful when accepting figures and graphs from lobbyists, especially if they are not willing to share the raw data. Sometimes, predictions are better left to astrologers.Cheers!",
    "preview": false
  },
  {
    "id": 121,
    "title": "Flask by Example – Updating the UI",
    "url": "https://realpython.com/flask-by-example-updating-the-ui/",
    "pub_date": "2015-02-24T15:50:42+00:00",
    "tags": [
      "web-dev",
      "basics",
      "front-end",
      "flask"
    ],
    "description": "In this part of the Flask by Example series, we'll update the user interface to make it more user friendly.",
    "text": "Conclusion\n What else could you add or change to better the user experience? Make the changes on your own or leave comments below. When done be sure to update both your staging and production environments.See you next time!",
    "preview": false
  },
  {
    "id": 122,
    "title": "Setting Up Sublime Text 3 for Full Stack Python Development",
    "url": "https://realpython.com/setting-up-sublime-text-3-for-full-stack-python-development/",
    "pub_date": "2014-08-11T13:24:04+00:00",
    "tags": [
      "basics",
      "tools"
    ],
    "description": "This article details how to set up Sublime Text for full stack Python development.",
    "text": "Conclusion\n I hope that this article was helpful to you and that you were able to integrate some of the above packages and custom settings along with your own based on your personal preferences to improve your workflow. If you have any questions or suggestions of your own, please let me know in the comments below. Finally, check out the dotfiles folder in this repo to view all the resources that I created. Cheers!",
    "preview": false
  },
  {
    "id": 123,
    "title": "Discover Flask, Part 2 – Creating a Login Page",
    "url": "https://realpython.com/introduction-to-flask-part-2-creating-a-login-page/",
    "pub_date": "2014-06-06T19:52:26+00:00",
    "tags": [
      "web-dev",
      "basics",
      "flask"
    ],
    "description": "In Part 2 of this series on the Flask framework, we'll set up a basic login page.",
    "text": "Conclusion\n What do you think? Simple, right? Don’t get too excited yet, as we still have much more to do with reguard to user management…Free Bonus: Click here to get access to a free Flask + Python video tutorial that shows you how to build Flask web app, step-by-step.Now that users have the ability to login, we need to protect that URL / from unauthorized access. In other words, when an end user hits that endpoint, unless they are already logged in, then they should be immediately sent to the login page. Next time. Until then, go practice some jQuery.Be sure to grab the code and watch the video.",
    "preview": false
  },
  {
    "id": 124,
    "title": "Discover Flask, Part 1 – Setting Up a Static Site",
    "url": "https://realpython.com/introduction-to-flask-part-1-setting-up-a-static-site/",
    "pub_date": "2014-06-04T19:22:03+00:00",
    "tags": [
      "web-dev",
      "basics",
      "flask"
    ],
    "description": "In Part 1 of this series on the Flask framework, we'll set up a basic project structure then develop a static site, styled with Bootstrap.",
    "text": "Conclusion\n What are your initial thoughts? Comment below. Grab the code. Watch the video.In under thirty minutes, you learned the Flask basics and set the ground work for a larger app. If you’ve worked with Django before, you probably noticed immediately that Flask stays out of your way as you develop, leaving you free to structure and design your app how you see fit. Because of the lack of structure, true beginners may struggle a bit, however it’s an invaluable learning experience that will benefit you in the long run, regardless of whether you continue working with Flask or move on to a higher-level framework.In the next tutorial we’ll look at adding some dynamic content.Cheers!",
    "preview": false
  },
  {
    "id": 125,
    "title": "Django 1.6 Test Driven Development",
    "url": "https://realpython.com/django-1-6-test-driven-development/",
    "pub_date": "2013-12-20T17:38:18+00:00",
    "tags": [
      "web-dev",
      "basics",
      "django",
      "testing"
    ],
    "description": "In this tutorial, we look at test driven development in Django",
    "text": "Conclusion\n Congrats. You make it through. What’s next?First, you may have noticed that I did not 100% follow the TDD process. That’s okay. Most developers engaged in TDD don’t always adhere to it in every single situation. There are times that you must deviate from it in order to just get things done - which is perfectly fine. If you’d like to refactor some of the code/process to fully adhere to the TDD process, you can. In fact, it may be a good practice.Second, think about the tests I missed. Determining what and when to test is difficult. It takes time and much practice to get good at testing in general. I’ve left many blanks that I intend to revel in my next post. See if you can find those and add tests.Finally, remember the last step in the TDD process? Refactoring. This step is vital as it helps create readable, maintainable code that you not only understand now - but in the future as well. When you look back at your code, think about tests you can combine. Also, which tests should you add to ensure that all written code is tested? You could test for null values and/or server side authentication, for example. You should refactor your code before moving on to writing any new code - which I did not do for time’s sake. Perhaps another blog post? Think about how bad code can pollute the entire process?Thanks for reading. Grab the final code in the repo here. Please comment below with any questions.",
    "preview": false
  },
  {
    "id": 126,
    "title": "An Effective Sales Page with Bootstrap 3",
    "url": "https://realpython.com/an-effective-sales-page-with-bootstrap-3/",
    "pub_date": "2013-10-01T15:05:14+00:00",
    "tags": [
      "web-dev",
      "basics",
      "front-end"
    ],
    "description": "In this tutorial, we'll be looking at Bootstrap 3 and how to customize it to create a nice landing page.",
    "text": "Closing thoughts\n That’s it. We built and customized a minimal sales page with Bootstrap. The page looks nothing like the same old Bootstrap page, and — best of all — it actually works in driving sales performance! Check it out here.Ok, I guess it’s full disclosure time: the page we built together is the core of an actual, real life tested, sales page.I wrote Bootstrap In Practice, an ebook for starters, to get them productive fast and go back to profit, without getting stuck in the official docs or going too much / too soon in depth led by mere intellectual curiosity.You can find the real, complete, battle-tested sales page on my website, where I also offer a free 30 day course about Bootstrap tips alongside a free sample chapter from the ebook.Next time we’ll add Flask to the mix and create a nice looking boilerplate that you can use for your own web app. Cheers!",
    "preview": false
  },
  {
    "id": 127,
    "title": "Getting Started with Bootstrap 3",
    "url": "https://realpython.com/getting-started-with-bootstrap-3/",
    "pub_date": "2013-09-13T14:04:00+00:00",
    "tags": [
      "web-dev",
      "basics",
      "front-end"
    ],
    "description": "In this tutorial, we'll be looking at Bootstrap 3 and how to customize it using HTML and CSS.",
    "text": "Make it your own\n Let’s look at some quick ways that you can customize this example to make it look less “Bootstrappy”.First, add a new stylesheet called main.css and add the embedded styles to it. Don’t forget to add the new stylesheet to the head, just beneath the first stylesheet. Also, add the following Google fonts as well as a link to the font awesome styles:Let’s put those new fonts to use:As you can probably tell, it’s difficult to find two fonts that look good together. Fortunately, there are a lot of good resources - like here and here.Textures can make a big difference, which is why I love Subtle Patterns. Update the body class with the following code. Make sure to make the Jumbotron transparent as well.Update the Marketing section so that there is just one row with three columns (each spanning 4 units). Let’s also put the new Glyphicons to use. Or you can use Font Awesome since we added the stylesheet.Above the marketing section let’s add a new row with two videos, which hopefully have something to do with your products or services (or at least explains why your site exists).By the way, I recorded those videos a few months ago which detail how to get started with a Django Project. Check them out, create a basic project, and then add some styles. :)Update the Jumbotron with some social sharing buttons and a few more icons. <3Finally, remove the text-mute class from the nav bar and add one more icon:And here’s the final version.Good? At the very least, with these basic changes—which took a good five minutes—you are now well underway to taking a generic theme and making it a bit more professional. Cheers. Ready for more? View the second part in this three part series. Oh—and check out these starter templates to get a quick start. Just add new fonts, colors, and a few textures…",
    "preview": false
  },
  {
    "id": 128,
    "title": "Python Web Applications with Flask – Part I",
    "url": "https://realpython.com/python-web-applications-with-flask-part-i/",
    "pub_date": "2013-08-14T03:22:01+00:00",
    "tags": [
      "web-dev",
      "basics",
      "flask"
    ],
    "description": "In this part of our series on Building a Web Application with Flask we'll set up our application.",
    "text": "Wrapping Up\n That’s it for this post. We now have a working application where sites can be added and visits recorded against them.  We still need to add user accounts, an easy to use client-side API for tracking, and reports.In Part II we will add users, access control, and enable users to add visits from their own websites. We will explore more best practices for writing templates, keeping our models and forms in sync, and handling static files.In Part III we’ll explore writing tests for our application, logging, and debugging errors.In Part IV we’ll do some Test Driven Development to enable our application to accept payments and display simple reports.In Part V we will write a RESTful JSON API for others to consume.In Part VI we will cover automating deployments (on Heroku) with Fabric and basic A/B Feature Testing.Finally, in Part VII we will cover preserving your application for the future with documentation, code coverage and quality metric tools.Thanks for reading and tune in next time!",
    "preview": false
  },
  {
    "id": 129,
    "title": "Testing in Django (Part 1) – Best Practices and Examples",
    "url": "https://realpython.com/testing-in-django-part-1-best-practices-and-examples/",
    "pub_date": "2013-08-06T02:33:56+00:00",
    "tags": [
      "best-practices",
      "web-dev",
      "django",
      "testing",
      "basics"
    ],
    "description": "In this tutorial, we look at the basics of unit testing in Django",
    "text": "Next Time\n In the next tutorial, we’ll be looking at a more complicated example as well as using model_mommy for generating test data. Again, you can grab the code from the repo.Free Bonus: Click here to get access to a free Django Learning Resources Guide (PDF) that shows you tips and tricks as well as common pitfalls to avoid when building Python + Django web applications.Got something to add? Leave a comment below.",
    "preview": false
  },
  {
    "id": 130,
    "title": "Developing with Bottle",
    "url": "https://realpython.com/developing-with-bottle-part-1/",
    "pub_date": "2013-06-18T02:33:19+00:00",
    "tags": [
      "web-dev",
      "basics"
    ],
    "description": "Let's look at how to create a basic application with Bottle",
    "text": "Next Steps\n From this point, it is as easy as adding new @route-decorated functions to create new pages.Creating the HTML is simple: In the above app, we just inlined the HTML in the file itself. It’s easy to modify this to load the template from a file. For example:This will load the template file main_template.tpl, which must be placed in a views folder within your project structure, and render it to the end user.Refer to the bottle documentation for more info.We’ll look at how to add additional pages and templates in subsequent posts. However, I urge you to try this on your own. Post any questions as comments below.Check out Part 2!",
    "preview": false
  }
]