[{"id": 1, "title": "Python's del: Remove References From Scopes and Containers", "url": "https://realpython.com/python-del-statement/", "pub_date": null, "tags": ["python", "best-practices", "basics"], "description": "In this tutorial, you'll learn how Python's del statement works and how to use it in your code. This statement will allow you to remove references from different scopes, items from lists, keys from dictionaries, and members from classes. This will lead to potentially memory-efficient code."}, {"id": 2, "title": "How to Read Python Input as Integers", "url": "https://realpython.com/python-input-integer/", "pub_date": null, "tags": ["basics"], "description": "In this tutorial, you'll learn how to use Python to get integer input from the user while handling any errors resulting from non-numeric input. This will involve coding your own reusable function built around input()."}, {"id": 3, "title": "The Terminal: First Steps and Useful Commands", "url": "https://realpython.com/terminal-commands/", "pub_date": "2023-02-22T14:00:00+00:00", "tags": ["basics", "tools"], "description": "The terminal is an essential tool in your journey as a Python developer.\r\nThis tutorial helps you to get started with the terminal, pip, and Git by showcasing interesting commands that you can incorporate into your workflow."}, {"id": 4, "title": "Build a Wordle Clone With Python and Rich", "url": "https://realpython.com/python-wordle-clone/", "pub_date": "2023-02-06T14:00:00+00:00", "tags": ["basics", "projects"], "description": "In this step-by-step project, you'll build your own Wordle clone with Python. Your game will run in the terminal, and you'll use Rich to ensure your word-guessing app looks good. Learn how to build a command-line application from scratch and then challenge your friends to a wordly competition!"}, {"id": 5, "title": "The Python Standard REPL: Try Out Code and Ideas Quickly", "url": "https://realpython.com/python-repl/", "pub_date": "2023-01-25T14:00:00+00:00", "tags": ["basics", "tools"], "description": "In this tutorial, you'll learn how to use the Python standard REPL (Read-Eval-Print Loop) to run your code interactively. This tool will allow you to test new ideas, explore and experiment with new tools and libraries, refactor and debug your code, try out examples, and more."}, {"id": 6, "title": "Python's \"in\" and \"not in\" Operators: Check for Membership", "url": "https://realpython.com/python-in-operator/", "pub_date": "2022-12-19T14:00:00+00:00", "tags": ["python", "best-practices", "basics"], "description": "In this tutorial, you'll learn how to check if a given value is present or absent in a collection of values using Python's in and not in operators, respectively. This type of check is known as membership test in Python."}, {"id": 7, "title": "Advent of Code: Solving Your Puzzles With Python", "url": "https://realpython.com/python-advent-of-code/", "pub_date": "2022-11-30T14:00:00+00:00", "tags": ["basics", "testing"], "description": "Advent of Code is an online advent calendar that shares new programming puzzles each day from December 1 to the 25. In this tutorial, you'll learn why solving programming puzzles can be beneficial and how you can get started with Advent of Code using Python."}, {"id": 8, "title": "How to Add Python to PATH", "url": "https://realpython.com/add-python-to-path/", "pub_date": "2022-09-26T14:00:00+00:00", "tags": ["best-practices", "devops", "basics"], "description": "In this tutorial, you'll learn about how to add Python, or any other program, to your PATH environment variable. You'll be covering the procedure in Windows, macOS, and Linux and find out what PATH is and why it's important."}, {"id": 9, "title": "How to Replace a String in Python", "url": "https://realpython.com/replace-string-python/", "pub_date": "2022-09-14T14:00:00+00:00", "tags": ["best-practices", "basics"], "description": "In this tutorial, you'll learn how to remove or replace a string or substring. You'll go from the basic string method .replace() all the way up to a multi-layer regex pattern using the sub() function from Python's re module."}, {"id": 10, "title": "HTML and CSS for Python Developers", "url": "https://realpython.com/html-css-python/", "pub_date": "2022-09-07T14:00:00+00:00", "tags": ["web-dev", "django", "flask", "front-end", "basics"], "description": "There's no way around HTML and CSS when you want to build web apps.\r\nEven if you're not aiming to become a web developer, knowing the basics of HTML and CSS will help you understand the Web better.\r\nIn this tutorial, you'll get an introduction to HTML and CSS for Python programmers."}, {"id": 11, "title": "How to Check if a Python String Contains a Substring", "url": "https://realpython.com/python-string-contains-substring/", "pub_date": "2022-08-22T14:00:00+00:00", "tags": ["best-practices", "basics"], "description": "In this tutorial, you'll learn the best way to check whether a Python string contains a substring. You'll also learn about idiomatic ways to inspect the substring further, match substrings with conditions using regular expressions, and search for substrings in pandas."}, {"id": 12, "title": "How to Find an Absolute Value in Python", "url": "https://realpython.com/python-absolute-value/", "pub_date": "2022-08-17T14:00:00+00:00", "tags": ["python", "basics"], "description": "In this tutorial, you'll learn how to calculate the absolute value in Python using the built-in abs() function. You'll also implement the corresponding mathematical formulas from scratch. Finally, you'll change the behavior of abs() in your own classes by hooking into Python's interface."}, {"id": 13, "title": "Your Python Coding Environment on Windows: Setup Guide", "url": "https://realpython.com/python-coding-setup-windows/", "pub_date": "2022-07-25T14:00:00+00:00", "tags": ["basics", "tools"], "description": "With this opinionated guide to setting up a basic, fully featured and flexible setup for Python coding and open source contributing when working from Windows, you'll go from a fresh install to ready to contribute, and even check out a PowerShell script to automate much of the process."}, {"id": 14, "title": "NumPy's max() and maximum(): Find Extreme Values in Arrays", "url": "https://realpython.com/numpy-max-maximum/", "pub_date": "2022-07-13T14:00:00+00:00", "tags": ["data-science", "basics"], "description": "In this introduction to NumPy, you'll learn how to find extreme values using the max() and maximum() functions. This includes finding the maximum element in an array or along a given axis of an array, as well as comparing two arrays to find the larger element in each index position."}, {"id": 15, "title": "How Can You Emulate Do-While Loops in Python?", "url": "https://realpython.com/python-do-while/", "pub_date": "2022-06-20T14:00:00+00:00", "tags": ["python", "best-practices", "basics"], "description": "In this tutorial, you'll learn how to emulate do-while loops in Python. The most common technique to do this is to create an infinite while loop with a conditional statement that controls the loop and jumps out of it using a break statement."}, {"id": 16, "title": "Build Your Python Project Documentation With MkDocs", "url": "https://realpython.com/python-project-documentation-with-mkdocs/", "pub_date": "2022-06-15T14:00:00+00:00", "tags": ["basics", "projects", "tools"], "description": "In this tutorial, you'll learn how to build professional documentation for a Python package using MkDocs and mkdocstrings. These tools allow you to generate nice-looking and modern documentation from Markdown files and, more importantly, from your code's docstrings."}, {"id": 17, "title": "Build a Quiz Application With Python", "url": "https://realpython.com/python-quiz-application/", "pub_date": "2022-06-08T14:00:00+00:00", "tags": ["basics", "projects"], "description": "In this step-by-step project, you'll build a Python quiz application for the terminal. Your app will ask you multiple-choice questions that you can use to strengthen your own knowledge or challenge your friends to test theirs."}, {"id": 18, "title": "Top Python Game Engines", "url": "https://realpython.com/top-python-game-engines/", "pub_date": "2022-05-04T14:00:00+00:00", "tags": ["gamedev", "basics"], "description": "In this tutorial, you'll explore several Python game engines available to you. For each, you'll code simple examples and a more advanced game to learn the game engine's strengths and weaknesses."}, {"id": 19, "title": "Python's min() and max(): Find Smallest and Largest Values", "url": "https://realpython.com/python-min-and-max/", "pub_date": "2022-05-02T14:00:00+00:00", "tags": ["python", "basics"], "description": "In this tutorial, you'll learn how to use Python's built-in min() and max() functions to find the smallest and largest values. You'll also learn how to modify their standard behavior by providing a suitable key function. Finally, you'll code a few practical examples of using min() and max()."}, {"id": 20, "title": "Python GUI Programming With Tkinter", "url": "https://realpython.com/python-gui-tkinter/", "pub_date": "2022-03-30T14:00:00+00:00", "tags": ["gui", "basics"], "description": "In this tutorial, you'll learn the basics of GUI programming with Tkinter, the de facto Python GUI framework. Master GUI programming concepts such as widgets, geometry managers, and event handlers. Then, put it all together by building two applications: a temperature converter and a text editor."}, {"id": 21, "title": "Manage Your To-Do Lists Using Python and Django", "url": "https://realpython.com/django-todo-lists/", "pub_date": "2022-03-02T14:00:00+00:00", "tags": ["web-dev", "basics", "projects", "django"], "description": "Use Django to build a to-do list manager app. This step-by-step project will teach you how to use Django's class-based views to build a powerful app while dramatically reducing your development time."}, {"id": 22, "title": "Python's all(): Check Your Iterables for Truthiness", "url": "https://realpython.com/python-all/", "pub_date": "2022-02-09T14:00:00+00:00", "tags": ["python", "best-practices", "basics"], "description": "In this step-by-step tutorial, you'll learn how to use Python's all() function to check if all the items in an iterable are truthy. You'll also code various examples that showcase a few interesting use cases of all() and highlight how you can use this function in Python."}, {"id": 23, "title": "Using Python's pip to Manage Your Projects' Dependencies", "url": "https://realpython.com/what-is-pip/", "pub_date": "2022-02-02T14:00:00+00:00", "tags": ["basics", "tools"], "description": "What is pip? In this beginner-friendly tutorial, you'll learn how to use pip, the standard package manager for Python, so that you can install and manage packages that aren't part of the Python standard library."}, {"id": 24, "title": "Raining Outside? Build a Weather CLI App With Python", "url": "https://realpython.com/build-a-python-weather-app-cli/", "pub_date": "2022-01-26T14:00:00+00:00", "tags": ["basics", "api"], "description": "In this tutorial, you'll write a nicely formatted Python CLI app that displays information about the current weather in any city you provide the name for."}, {"id": 25, "title": "Build a Dice-Rolling Application With Python", "url": "https://realpython.com/python-dice-roll/", "pub_date": "2022-01-19T14:00:00+00:00", "tags": ["basics", "projects"], "description": "In this step-by-step project, you'll build a dice-rolling simulator app with a minimal text-based user interface using Python. The app will simulate the rolling of up to six dice. Each individual die will have six sides."}, {"id": 26, "title": "Using the \"not\" Boolean Operator in Python", "url": "https://realpython.com/python-not-operator/", "pub_date": "2021-10-25T14:00:00+00:00", "tags": ["python", "basics"], "description": "In this step-by-step tutorial, you'll learn how Python's \"not\" operator works and how to use it in your code. You'll get to know its features and see what kind of programming problems you can solve by using \"not\" in Python."}, {"id": 27, "title": "Using the len() Function in Python", "url": "https://realpython.com/len-python-function/", "pub_date": "2021-10-20T14:00:00+00:00", "tags": ["python", "basics"], "description": "In this tutorial, you'll learn how and when to use the len() Python function. You'll also learn how to customize your class definitions so that objects of a user-defined class can be used as arguments in len()."}, {"id": 28, "title": "Representing Rational Numbers With Python Fractions", "url": "https://realpython.com/python-fractions/", "pub_date": "2021-10-11T14:00:00+00:00", "tags": ["python", "basics"], "description": "In this tutorial, you'll learn about the Fraction data type in Python, which can represent rational numbers precisely without the rounding errors in binary arithmetic. You'll find that this is especially important in financial and other high-precision applications."}, {"id": 29, "title": "Python's sum(): The Pythonic Way to Sum Values", "url": "https://realpython.com/python-sum-function/", "pub_date": "2021-10-06T14:00:00+00:00", "tags": ["python", "basics"], "description": "In this step-by-step tutorial, you'll learn how to use Python's sum() function to add numeric values together. You also learn how to concatenate sequences, such as lists and tuples, using sum()."}, {"id": 30, "title": "Reverse Strings in Python: reversed(), Slicing, and More", "url": "https://realpython.com/reverse-string-python/", "pub_date": "2021-09-27T14:00:00+00:00", "tags": ["python", "best-practices", "basics"], "description": "In this step-by-step tutorial, you'll learn how to reverse strings in Python by using available tools such as reversed() and slicing operations. You'll also learn about a few useful ways to build reversed strings by hand."}, {"id": 31, "title": "Using the \"and\" Boolean Operator in Python", "url": "https://realpython.com/python-and-operator/", "pub_date": "2021-09-20T14:00:00+00:00", "tags": ["python", "best-practices", "basics"], "description": "In this step-by-step tutorial, you'll learn how Python's \"and\" operator works and how to use it in your code. You'll get to know its special features and see what kind of programming problems you can solve by using \"and\" in Python."}, {"id": 32, "title": "Build a Personal Diary With Django and Python", "url": "https://realpython.com/django-diary-project-python/", "pub_date": "2021-09-15T14:00:00+00:00", "tags": ["web-dev", "projects", "django", "front-end", "basics"], "description": "In this beginner-friendly tutorial, you'll build a personal diary in Django. You'll use the strengths of the Django web framework and learn the basics of web apps."}, {"id": 33, "title": "How Long Does It Take to Learn Python?", "url": "https://realpython.com/how-long-does-it-take-to-learn-python/", "pub_date": "2021-09-06T14:00:00+00:00", "tags": ["community", "basics"], "description": "In this article, you'll assess whether or not learning Python is a good investment of your time, how long it will take you, and what background factors you need to consider when planning your learning journey. You'll also learn what resources exist that can help you get started."}, {"id": 34, "title": "Using Python Optional Arguments When Defining Functions", "url": "https://realpython.com/python-optional-arguments/", "pub_date": "2021-08-30T14:00:00+00:00", "tags": ["python", "basics"], "description": "In this tutorial, you'll learn about Python optional arguments and how to define functions with default values. You'll also learn how to create functions that accept any number of arguments using args and kwargs."}, {"id": 35, "title": "Your First Steps With Django: Set Up a Django Project", "url": "https://realpython.com/django-setup/", "pub_date": "2021-07-21T14:05:12+00:00", "tags": ["best-practices", "basics", "django", "web-dev"], "description": "This tutorial provides a walkthrough and a reference for starting a Django project and app. You can use it as a quick setup guide for any future Django project and tutorial you'll work on."}, {"id": 36, "title": "Using FastAPI to Build Python Web APIs", "url": "https://realpython.com/fastapi-python-web-apis/", "pub_date": "2021-07-14T14:00:00+00:00", "tags": ["web-dev", "basics", "api"], "description": "In this guide, you'll learn the main concepts of FastAPI and how to use it to quickly create web APIs that implement best practices by default. By the end of it, you will be able to start creating production-ready web APIs."}, {"id": 37, "title": "What Can I Do With Python?", "url": "https://realpython.com/what-can-i-do-with-python/", "pub_date": "2021-07-07T14:00:00+00:00", "tags": ["basics"], "description": "In this tutorial, you'll find a set of guidelines that will help you start applying your Python skills to real-world problems. By the end of your reading, you'll be able to answer the question \"What can I do with Python?\""}, {"id": 38, "title": "Python's Counter: The Pythonic Way to Count Objects", "url": "https://realpython.com/python-counter/", "pub_date": "2021-07-05T14:00:00+00:00", "tags": ["python", "basics"], "description": "In this step-by-step tutorial, you'll learn how to use Python's Counter to count several repeated objects at once."}, {"id": 39, "title": "Reverse Python Lists: Beyond .reverse() and reversed()", "url": "https://realpython.com/python-reverse-list/", "pub_date": "2021-06-28T14:00:00+00:00", "tags": ["python", "basics"], "description": "In this step-by-step tutorial, you'll learn about Python's tools and techniques to work with lists in reverse order. You'll also learn how to reverse your list by hand."}, {"id": 40, "title": "Natural Language Processing With Python's NLTK Package", "url": "https://realpython.com/nltk-nlp-python/", "pub_date": "2021-05-05T14:00:00+00:00", "tags": ["data-science", "basics"], "description": "In this beginner-friendly tutorial, you'll take your first steps with Natural Language Processing (NLP) and Python's Natural Language Toolkit (NLTK). You'll learn how to process unstructured data in order to be able to analyze it and draw conclusions from it."}, {"id": 41, "title": "Python Basics: Paperback Now Available!", "url": "https://realpython.com/python-basics-paperback/", "pub_date": "2021-04-26T14:00:00+00:00", "tags": ["community", "basics"], "description": "After years of writing, reviewing, and testing, we’re delighted to announce that Python Basics: A Practical Introduction to Python 3 is now available in paperback! In this article, you’ll see how you can level up your Python with Python Basics and how other Pythonistas have already been doing it."}, {"id": 42, "title": "How to Use Python: Your First Steps", "url": "https://realpython.com/python-first-steps/", "pub_date": "2021-01-25T16:27:13+00:00", "tags": ["python", "basics"], "description": "In this step-by-step tutorial, you'll learn the basics of how to use Python. With this knowledge, you'll be able to start coding your Python applications."}, {"id": 43, "title": "C for Python Programmers", "url": "https://realpython.com/c-for-python-programmers/", "pub_date": "2021-01-20T14:00:00+00:00", "tags": ["basics"], "description": "In this tutorial, you'll learn the basics of the C language, which is used in the source code for CPython, the most popular Python implementation. Learning C is important for Python programmers interested in contributing to CPython."}, {"id": 44, "title": "Make Your First Python Game: Rock, Paper, Scissors!", "url": "https://realpython.com/python-rock-paper-scissors/", "pub_date": "2021-01-18T14:00:00+00:00", "tags": ["gamedev", "basics", "projects"], "description": "In this tutorial, you'll learn to program rock paper scissors in Python from scratch. You'll learn how to take in user input, make the computer choose a random action, determine a winner, and split your code into functions."}, {"id": 45, "title": "NumPy Tutorial: Your First Steps Into Data Science in Python", "url": "https://realpython.com/numpy-tutorial/", "pub_date": "2021-01-11T14:00:00+00:00", "tags": ["data-science", "basics"], "description": "In this tutorial, you'll learn everything you need to know to get up and running with NumPy, Python's de facto standard for multidimensional data arrays. NumPy is the foundation for most data science in Python, so if you're interested in that field, then this is a great place to start."}, {"id": 46, "title": "Python's .append(): Add Items to Your Lists in Place", "url": "https://realpython.com/python-append/", "pub_date": "2021-01-04T14:00:00+00:00", "tags": ["python", "basics"], "description": "In this step-by-step tutorial, you'll learn how Python's .append() works and how to use it for adding items to your list in place. You'll also learn how to code your own stacks and queues using .append() and .pop()."}, {"id": 47, "title": "The pass Statement: How to Do Nothing in Python", "url": "https://realpython.com/python-pass/", "pub_date": "2020-12-16T14:00:00+00:00", "tags": ["python", "basics"], "description": "In this tutorial, you'll learn about the Python pass statement, which tells the interpreter to do nothing. Even though pass has no effect on program execution, it can be useful. You'll see several use cases for pass as well as some alternative ways to do nothing in your code."}, {"id": 48, "title": "What Is Data Engineering and Is It Right for You?", "url": "https://realpython.com/python-data-engineer/", "pub_date": "2020-12-14T14:00:00+00:00", "tags": ["basics"], "description": "In this article, you'll get an overview of the discipline of data engineering. You'll learn what is and isn't part of a data engineer's job, who data engineers work with, and why data engineers play a crucial role in many industries."}, {"id": 49, "title": "Python enumerate(): Simplify Looping With Counters", "url": "https://realpython.com/python-enumerate/", "pub_date": "2020-11-18T14:00:00+00:00", "tags": ["best-practices", "basics"], "description": "Once you learn about for loops in Python, you know that using an index to access items in a sequence isn't very Pythonic. So what do you do when you need that index value? In this tutorial, you'll learn all about Python's built-in enumerate(), where it's used, and how you can emulate its behavior."}, {"id": 50, "title": "Python Modulo in Practice: How to Use the % Operator", "url": "https://realpython.com/python-modulo-operator/", "pub_date": "2020-10-26T14:00:00+00:00", "tags": ["python", "basics"], "description": "In this tutorial, you'll learn about the Python modulo operator (%). You'll look at the mathematical concepts behind the modulo operation and how the modulo operator is used with Python's numeric types. You'll also see ways to use the modulo operator in your own code."}, {"id": 51, "title": "Python's map(): Processing Iterables Without a Loop", "url": "https://realpython.com/python-map-function/", "pub_date": "2020-09-30T14:00:00+00:00", "tags": ["python", "best-practices", "basics"], "description": "In this step-by-step tutorial, you'll learn how Python's map() works and how to use it effectively in your programs. You'll also learn how to use list comprehension and generator expressions to replace map() in a Pythonic and efficient way."}, {"id": 52, "title": "The Python return Statement: Usage and Best Practices", "url": "https://realpython.com/python-return-statement/", "pub_date": "2020-09-28T14:00:00+00:00", "tags": ["python", "best-practices", "basics"], "description": "In this step-by-step tutorial, you'll learn how to use the Python return statement when writing functions. Additionally, you'll cover some good programming practices related to the use of return. With this knowledge, you'll be able to write readable, robust, and maintainable functions in Python."}, {"id": 53, "title": "Numbers in Python", "url": "https://realpython.com/python-numbers/", "pub_date": "2020-09-16T14:00:00+00:00", "tags": ["python", "basics"], "description": "In this tutorial, you'll learn about numbers and basic math in Python. You'll explore integer, floating-point numbers, and complex numbers and see how perform calculations using Python's arithmetic operators, math functions, and number methods."}, {"id": 54, "title": "Find & Fix Code Bugs in Python: Debug With IDLE", "url": "https://realpython.com/python-debug-idle/", "pub_date": "2020-09-09T14:00:00+00:00", "tags": ["basics", "tools"], "description": "In this tutorial, you'll learn how to identify and fix logic errors, or bugs, in your Python code. You'll use the built-in debugging tools in Python's Integrated Development and Learning Environment to practice locating and resolving bugs in an example function."}, {"id": 55, "title": "Python 3 Installation & Setup Guide", "url": "https://realpython.com/installing-python/", "pub_date": "2020-08-31T16:15:29+00:00", "tags": ["best-practices", "basics", "tools"], "description": "The first step to getting started with Python is to install it on your machine. In this tutorial, you'll learn how to check which version of Python, if any, you have on your Windows, Mac, or Linux computer and the best way to install the most recent version in any environment."}, {"id": 56, "title": "Common Python Data Structures (Guide)", "url": "https://realpython.com/python-data-structures/", "pub_date": "2020-08-26T14:00:00+00:00", "tags": ["python", "basics"], "description": "In this tutorial, you'll learn about Python's data structures. You'll look at several implementations of abstract data types and learn which implementations are best for your specific use cases."}, {"id": 57, "title": "Namespaces and Scope in Python", "url": "https://realpython.com/python-namespaces-scope/", "pub_date": "2020-07-29T14:00:00+00:00", "tags": ["python", "basics"], "description": "In this tutorial, you'll learn about Python namespaces, the structures used to store and organize the symbolic names created during execution of a Python program. You'll learn when namespaces are created, how they are implemented, and how they define variable scope."}, {"id": 58, "title": "Python Keywords: An Introduction", "url": "https://realpython.com/python-keywords/", "pub_date": "2020-06-15T14:00:00+00:00", "tags": ["python", "basics"], "description": "Python keywords make up the fundamental building blocks of any Python program. In this tutorial, you'll learn the basic syntax and usage for each of Python's thirty-five keywords so you can write more efficient and readable code."}, {"id": 59, "title": "Regular Expressions: Regexes in Python (Part 2)", "url": "https://realpython.com/regex-python-part-2/", "pub_date": "2020-06-03T14:00:00+00:00", "tags": ["python", "basics"], "description": "In the previous tutorial in this series, you learned how to perform sophisticated pattern matching using regular expressions, or regexes, in Python.  This tutorial explores more regex tools and techniques that are available in Python."}, {"id": 60, "title": "Regular Expressions: Regexes in Python (Part 1)", "url": "https://realpython.com/regex-python/", "pub_date": "2020-04-29T14:00:00+00:00", "tags": ["python", "basics"], "description": "In previous tutorials in this series, you've seen several different ways to compare string values with direct character-by-character comparison. In this tutorial, you'll learn how to perform more complex string pattern matching using regular expressions, or regexes, in Python."}, {"id": 61, "title": "How to Use any() in Python", "url": "https://realpython.com/any-python/", "pub_date": "2020-03-30T14:00:00+00:00", "tags": ["python", "basics"], "description": "If you've ever wondered how to simplify complex conditionals by determining if at least one in a series of conditions is true, then look no further. This tutorial will teach you all about how to use any() in Python to do just that."}, {"id": 62, "title": "Using the Python defaultdict Type for Handling Missing Keys", "url": "https://realpython.com/python-defaultdict/", "pub_date": "2020-03-11T14:00:00+00:00", "tags": ["python", "basics"], "description": "In this step-by-step tutorial, you'll learn how the Python defaultdict type works and how to use it for handling missing keys when you're working with dictionaries. You'll also learn how to use a defaultdict to solve problems like grouping or counting the items in a sequence or collection."}, {"id": 63, "title": "Defining Your Own Python Function", "url": "https://realpython.com/defining-your-own-python-function/", "pub_date": "2020-03-09T14:00:00+00:00", "tags": ["python", "basics"], "description": "In this tutorial, you'll learn how to define and call your own Python function.  You'll also learn about passing data to your function, and returning data from your function back to its calling environment."}, {"id": 64, "title": "The Beginner's Guide to Python Turtle", "url": "https://realpython.com/beginners-guide-python-turtle/", "pub_date": "2020-02-26T14:00:00+00:00", "tags": ["python", "basics"], "description": "In this step-by-step tutorial, you'll learn the basics of Python programming with the help of a simple and interactive Python library called turtle. If you're a beginner to Python, then this tutorial will definitely help you on your journey as you take your first steps into the world of programming."}, {"id": 65, "title": "Introduction to Python SQL Libraries", "url": "https://realpython.com/python-sql-libraries/", "pub_date": "2020-02-24T14:00:00+00:00", "tags": ["databases", "basics", "tools"], "description": "In this step-by-step tutorial, you'll learn how to connect to different database management systems by using various Python SQL libraries. You'll interact with SQLite, MySQL, and PostgreSQL databases and perform common database queries using a Python application."}, {"id": 66, "title": "Null in Python: Understanding Python's NoneType Object", "url": "https://realpython.com/null-in-python/", "pub_date": "2020-02-19T14:00:00+00:00", "tags": ["python", "basics"], "description": "In this tutorial, you'll learn about the NoneType object None, which acts as the null in Python. This object represents emptiness, and you can use it to mark default parameters and even show when you have no result. None is a tool for doing everything with nothing!"}, {"id": 67, "title": "A Guide to the Newer Python String Format Techniques", "url": "https://realpython.com/python-formatted-output/", "pub_date": "2020-02-17T14:00:00+00:00", "tags": ["python", "basics"], "description": "In the last tutorial in this series, you learned how to format string data using the string modulo operator.  In this tutorial, you'll see two more items to add to your Python string formatting toolkit. You'll learn about Python's string format method and the formatted string literal, or f-string."}, {"id": 68, "title": "Using pandas and Python to Explore Your Dataset", "url": "https://realpython.com/pandas-python-explore-dataset/", "pub_date": "2020-01-06T14:00:00+00:00", "tags": ["data-science", "basics"], "description": "In this step-by-step tutorial, you'll learn how to start exploring a dataset with pandas and Python. You'll learn how to access specific rows and columns to answer questions about your data. You'll also see how to handle missing values and prepare to visualize your dataset in a Jupyter notebook."}, {"id": 69, "title": "Invalid Syntax in Python: Common Reasons for SyntaxError", "url": "https://realpython.com/invalid-syntax-python/", "pub_date": "2019-11-20T14:00:00+00:00", "tags": ["python", "basics"], "description": "In this step-by-step tutorial, you'll see common examples of invalid syntax in Python and learn how to resolve the issue. If you've ever received a SyntaxError when trying to run your Python code, then this is the guide for you!"}, {"id": 70, "title": "Getting Started With Python IDLE", "url": "https://realpython.com/python-idle/", "pub_date": "2019-11-13T14:00:00+00:00", "tags": ["basics"], "description": "In this tutorial, you'll learn how to use the development environment included with your Python installation. Python IDLE is a small program that packs a big punch!  You'll learn how to use Python IDLE to interact with Python directly, work with Python files, and improve your development workflow."}, {"id": 71, "title": "When to Use a List Comprehension in Python", "url": "https://realpython.com/list-comprehension-python/", "pub_date": "2019-11-06T14:00:00+00:00", "tags": ["python", "basics"], "description": "Python list comprehensions make it easy to create lists while performing sophisticated filtering, mapping, and conditional logic on their members. In this tutorial, you'll learn when to use a list comprehension in Python and how to create them effectively."}, {"id": 72, "title": "Using the Python zip() Function for Parallel Iteration", "url": "https://realpython.com/python-zip-function/", "pub_date": "2019-10-02T14:00:00+00:00", "tags": ["python", "basics"], "description": "In this step-by-step tutorial, you'll learn how to use the Python zip() function to solve common programming problems. You'll learn how to traverse multiple iterables in parallel and create dictionaries with just a few lines of code."}, {"id": 73, "title": "How to Convert a Python String to int", "url": "https://realpython.com/convert-python-string-to-int/", "pub_date": "2019-09-18T14:00:00+00:00", "tags": ["python", "basics"], "description": "There are several ways to represent integers in Python. In this quick and practical tutorial, you'll learn how you can store integers using int and str as well as how you can convert a Python string to an int and vice versa."}, {"id": 74, "title": "MATLAB vs Python: Why and How to Make the Switch", "url": "https://realpython.com/matlab-vs-python/", "pub_date": "2019-09-09T14:00:00+00:00", "tags": ["best-practices", "data-science", "basics"], "description": "In this step-by-step tutorial, you'll learn about MATLAB vs Python, why you should switch from MATLAB to Python, the packages you'll need to make a smooth transition, and the bumps you'll most likely encounter along the way."}, {"id": 75, "title": "An Effective Python Environment: Making Yourself at Home", "url": "https://realpython.com/effective-python-environment/", "pub_date": "2019-08-14T14:00:00+00:00", "tags": ["basics", "tools"], "description": "This guide will walk you through the decisions you need to make when customizing your development environment for working with Python."}, {"id": 76, "title": "Your Guide to the Python print() Function", "url": "https://realpython.com/python-print/", "pub_date": "2019-08-12T14:00:00+00:00", "tags": ["python", "basics"], "description": "In this step-by-step tutorial, you'll learn about the print() function in Python and discover some of its lesser-known features. Avoid common mistakes, take your \"hello world\" to the next level, and know when to use a better alternative."}, {"id": 77, "title": "Understanding the Python Traceback", "url": "https://realpython.com/python-traceback/", "pub_date": "2019-07-29T14:00:00+00:00", "tags": ["python", "basics"], "description": "In this step-by-step tutorial, you'll learn how to read and understand the information you can get from a Python traceback. You'll walk through several examples of tracebacks and see some of the most common tracebacks in Python."}, {"id": 78, "title": "The Python Square Root Function", "url": "https://realpython.com/python-square-root-function/", "pub_date": "2019-07-08T14:00:00+00:00", "tags": ["basics"], "description": "In this quick and practical tutorial, you'll learn what a square root is and how to calculate one in Python. You'll even see how you can use the Python square root function to solve a real-world problem."}, {"id": 79, "title": "Using the \"or\" Boolean Operator in Python", "url": "https://realpython.com/python-or-operator/", "pub_date": "2019-07-03T14:00:00+00:00", "tags": ["python", "basics"], "description": "In this step-by-step tutorial, you'll learn how the Python \"or\" operator works and how to use it. You'll get to know its special features and see what kind of programming problems you can solve by using \"or\" in Python."}, {"id": 80, "title": "Basic Input, Output, and String Formatting in Python", "url": "https://realpython.com/python-input-output/", "pub_date": "2019-06-24T14:00:00+00:00", "tags": ["python", "basics"], "description": "In this step-by-step Python tutorial, you'll learn how to take user input from the keyboard with the built-in function input(), how to display output to the console with the built-in function print(), and how to format string data with Python f-strings."}, {"id": 81, "title": "How to Implement a Python Stack", "url": "https://realpython.com/how-to-implement-python-stack/", "pub_date": "2019-06-05T14:00:00+00:00", "tags": ["basics"], "description": "In this tutorial, you'll learn how to implement a Python stack. You'll see how to recognize when a stack is a good choice for data structures, how to decide which implementation is best for a program, and what extra considerations to make about stacks in a threading or multiprocessing environment."}, {"id": 82, "title": "Playing and Recording Sound in Python", "url": "https://realpython.com/playing-and-recording-sound-python/", "pub_date": "2019-05-13T14:00:00+00:00", "tags": ["basics"], "description": "In this tutorial, you'll learn about libraries that can be used for playing and recording sound in Python, such as PyAudio and python-sounddevice. You'll also see code snippets for playing and recording sound files and arrays, as well as for converting between different sound file formats."}, {"id": 83, "title": "How to Use sorted() and sort() in Python", "url": "https://realpython.com/python-sort/", "pub_date": "2019-05-06T14:00:00+00:00", "tags": ["python", "basics"], "description": "In this step-by-step tutorial, you’ll learn how to sort in Python. You'll know how to sort various types of data in different data structures, customize the order, and work with two different ways of sorting in Python."}, {"id": 84, "title": "Python KeyError Exceptions and How to Handle Them", "url": "https://realpython.com/python-keyerror/", "pub_date": "2019-04-24T14:00:00+00:00", "tags": ["python", "basics"], "description": "In this tutorial, you'll learn how to handle Python KeyError exceptions. They are often caused by a bad key lookup in a dictionary, but there are a few other situations when a KeyError can be raised as well. Knowing how to handle these exceptions is essential to writing good Python code."}, {"id": 85, "title": "How to Run Your Python Scripts", "url": "https://realpython.com/run-python-scripts/", "pub_date": "2019-02-18T06:00:00+00:00", "tags": ["python", "basics"], "description": "This step-by-step tutorial will guide you through a series of ways to run Python scripts, depending on your environment, platform, needs, and skills as a programmer."}, {"id": 86, "title": "Python \"for\" Loops (Definite Iteration)", "url": "https://realpython.com/python-for-loop/", "pub_date": "2019-01-30T06:00:00+00:00", "tags": ["python", "basics"], "description": "In this introductory tutorial, you'll learn all about how to perform definite iteration with Python for loops. You’ll see how other programming languages implement definite iteration, learn about iterables and iterators, and tie it all together to learn about Python’s for loop."}, {"id": 87, "title": "Working With Files in Python", "url": "https://realpython.com/working-with-files-in-python/", "pub_date": "2019-01-21T06:00:00+00:00", "tags": ["python", "basics"], "description": "In this tutorial, you'll learn how you can work with files in Python by using built-in modules to perform practical tasks that involve groups of files, like renaming them, moving them around, archiving them, and getting their metadata."}, {"id": 88, "title": "Django Migrations: A Primer", "url": "https://realpython.com/django-migrations-a-primer/", "pub_date": "2019-01-09T12:10:21+00:00", "tags": ["databases", "web-dev", "basics", "django"], "description": "In this tutorial, you’ll get comfortable with Django migrations and learn how to create database tables without writing any SQL, how to automatically modify your database after you changed your models, and how to revert changes made to your database."}, {"id": 89, "title": "Thonny: The Beginner-Friendly Python Editor", "url": "https://realpython.com/python-thonny/", "pub_date": "2018-12-12T14:00:00+00:00", "tags": ["basics", "tools"], "description": "In this tutorial, you’ll learn all about Thonny, a free Python Integrated Development Environment (IDE) that was especially designed with the beginner Pythonista in mind. It has a built-in debugger and allows you to do step-through expression evaluation."}, {"id": 90, "title": "Python \"while\" Loops (Indefinite Iteration)", "url": "https://realpython.com/python-while-loop/", "pub_date": "2018-11-07T14:00:00+00:00", "tags": ["python", "basics"], "description": "In this tutorial, you'll learn about indefinite iteration using the Python while loop. You’ll be able to construct basic and complex while loops, interrupt loop execution with break and continue, use the else clause with a while loop, and deal with infinite loops."}, {"id": 91, "title": "Writing Comments in Python (Guide)", "url": "https://realpython.com/python-comments-guide/", "pub_date": "2018-11-05T14:00:00+00:00", "tags": ["best-practices", "basics"], "description": "Learn how to write Python comments that are clean, concise, and useful. Quickly get up to speed on what the best practices are, which types of comments it's best to avoid, and how you can practice writing cleaner comments."}, {"id": 92, "title": "Setting Up Python for Machine Learning on Windows", "url": "https://realpython.com/python-windows-machine-learning-setup/", "pub_date": "2018-10-31T14:00:00+00:00", "tags": ["machine-learning", "data-science", "basics"], "description": "In this step-by-step tutorial, you’ll cover the basics of setting up a Python numerical computation environment for machine learning on a Windows machine using the Anaconda Python distribution."}, {"id": 93, "title": "The Python range() Function (Guide)", "url": "https://realpython.com/python-range/", "pub_date": "2018-10-15T14:00:00+00:00", "tags": ["python", "basics"], "description": "Master the Python range() function, learn how its implementation differs in Python 3 vs 2, and see how you can use it to write faster and more Pythonic code."}, {"id": 94, "title": "Splitting, Concatenating, and Joining Strings in Python", "url": "https://realpython.com/python-string-split-concatenate-join/", "pub_date": "2018-10-01T14:00:00+00:00", "tags": ["python", "basics"], "description": "In this beginner-friendly article, you’ll learn some of the most fundamental string operations: splitting, concatenating, and joining. Not only will you learn how to use these tools, but you’ll walk away with a deeper understanding of how they work under the hood in Python."}, {"id": 95, "title": "The Best Python Books", "url": "https://realpython.com/best-python-books/", "pub_date": "2018-09-10T14:00:00+00:00", "tags": ["intermediate", "basics", "community"], "description": "Find the right books to help you get started with Python or take your coding to the next level with this detailed guide to the best Python books out there."}, {"id": 96, "title": "Conditional Statements in Python", "url": "https://realpython.com/python-conditional-statements/", "pub_date": "2018-09-05T14:00:00+00:00", "tags": ["python", "basics"], "description": "In this step-by-step tutorial you'll learn how to work with conditional (\"if\") statements in Python. Master if-statements and see how to write complex decision making code in your programs."}, {"id": 97, "title": "Python Program Lexical Structure", "url": "https://realpython.com/python-program-structure/", "pub_date": "2018-09-03T14:00:00+00:00", "tags": ["python", "basics"], "description": "In this tutorial you'll dig deeper into Python's lexical structure and start arranging code into more complex groupings. You'll learn about the syntactic elements that comprise statements, the basic units that make up a Python program."}, {"id": 98, "title": "Sets in Python", "url": "https://realpython.com/python-sets/", "pub_date": "2018-08-20T14:00:00+00:00", "tags": ["python", "basics"], "description": "In this tutorial you'll learn how to work effectively with Python's set data type. You'll see how to define set objects in Python and discover the operations that they support and by the end of the tutorial you'll have a good feel for when a set is an appropriate choice in your own programs."}, {"id": 99, "title": "Dictionaries in Python", "url": "https://realpython.com/python-dicts/", "pub_date": "2018-08-06T14:00:00+00:00", "tags": ["python", "basics"], "description": "In this Python dictionaries tutorial, you'll cover the basic characteristics and learn how to access and manage dictionary data. Once you have finished this tutorial, you should have a good sense of when a dictionary is the appropriate data type to use, and how to do so."}, {"id": 100, "title": "Lists and Tuples in Python", "url": "https://realpython.com/python-lists-tuples/", "pub_date": "2018-07-18T14:00:00+00:00", "tags": ["python", "basics"], "description": "You'll cover the important characteristics of lists and tuples in Python 3. You'll learn how to define them and how to manipulate them. When you're finished, you should have a good feel for when and how to use these object types in a Python program."}, {"id": 101, "title": "Strings and Character Data in Python", "url": "https://realpython.com/python-strings/", "pub_date": "2018-07-09T14:00:00+00:00", "tags": ["python", "basics"], "description": "In this tutorial you'll learn how to use Python's rich set of operators, functions, and methods for working with strings. You'll learn how to access and extract portions of strings, and also become familiar with the methods that are available to manipulate and modify string data in Python 3."}, {"id": 102, "title": "Python String Formatting Best Practices", "url": "https://realpython.com/python-string-formatting/", "pub_date": "2018-07-04T14:00:00+00:00", "tags": ["python", "best-practices", "basics"], "description": "Learn the four main approaches to string formatting in Python, as well as their strengths and weaknesses. You'll also get a simple rule of thumb for how to pick the best general purpose string formatting approach in your own programs."}, {"id": 103, "title": "Python Histogram Plotting: NumPy, Matplotlib, pandas & Seaborn", "url": "https://realpython.com/python-histograms/", "pub_date": "2018-07-02T14:00:00+00:00", "tags": ["data-science", "basics"], "description": "In this tutorial, you'll be equipped to make production-quality, presentation-ready Python histogram plots with a range of choices and features. It's your one-stop shop for constructing & manipulating histograms with Python's scientific stack."}, {"id": 104, "title": "Operators and Expressions in Python", "url": "https://realpython.com/python-operators-expressions/", "pub_date": "2018-06-20T14:00:00+00:00", "tags": ["python", "basics"], "description": "You'll see how calculations can be performed on objects in Python. By the end of this tutorial, you will be able to create complex expressions by combining Python objects and operators."}, {"id": 105, "title": "Variables in Python", "url": "https://realpython.com/python-variables/", "pub_date": "2018-06-12T14:00:00+00:00", "tags": ["python", "basics"], "description": "Learn how every item of data in a Python program can be described by the abstract term \"object,\" and how to manipulate objects using symbolic names called \"variables.\""}, {"id": 106, "title": "Basic Data Types in Python", "url": "https://realpython.com/python-data-types/", "pub_date": "2018-06-05T14:00:00+00:00", "tags": ["python", "basics"], "description": "Learn the basic data types that are built into Python, like numbers, strings, and Booleans. You'll also get an overview of Python's built-in functions."}, {"id": 107, "title": "Python Application Layouts: A Reference", "url": "https://realpython.com/python-application-layouts/", "pub_date": "2018-06-04T14:00:00+00:00", "tags": ["best-practices", "basics"], "description": "A reference guide to common Python application layouts and project structures for command-line applications, web applications, and more."}, {"id": 108, "title": "Interacting With Python", "url": "https://realpython.com/interacting-with-python/", "pub_date": "2018-05-28T14:00:00+00:00", "tags": ["basics"], "description": "How to actually execute Python code and run Python programs using the CPython REPL, executing script files, and integrated development environments."}, {"id": 109, "title": "Introduction to Python 3", "url": "https://realpython.com/python-introduction/", "pub_date": "2018-05-21T14:00:00+00:00", "tags": ["basics"], "description": "An overview of the Python programming language, including a brief history of the development of Python\r\nand reasons why you might select Python as your language of choice."}, {"id": 110, "title": "Python 3's f-Strings: An Improved String Formatting Syntax (Guide)", "url": "https://realpython.com/python-f-strings/", "pub_date": "2018-05-14T14:00:00+00:00", "tags": ["python", "basics"], "description": "As of Python 3.6, f-strings are a great new way to format strings. Not only are they more readable, more concise, and less prone to error than other ways of formatting, but they are also faster! By the end of this article, you will learn how and why to start using f-strings today."}, {"id": 111, "title": "Python Exceptions: An Introduction", "url": "https://realpython.com/python-exceptions/", "pub_date": "2018-04-30T14:00:00+00:00", "tags": ["python", "basics"], "description": "In this beginner tutorial you'll learn what exceptions are good for in Python. You'll see how to raise exceptions and how to handle them with \"try/except\" blocks."}, {"id": 112, "title": "Python Modules and Packages – An Introduction", "url": "https://realpython.com/python-modules-packages/", "pub_date": "2018-04-17T14:00:00+00:00", "tags": ["python", "basics"], "description": "This article explores Python modules and Python packages, two mechanisms that facilitate modular programming."}, {"id": 113, "title": "Introduction to Git and GitHub for Python Developers", "url": "https://realpython.com/python-git-github-intro/", "pub_date": "2018-04-04T14:00:00+00:00", "tags": ["basics", "tools"], "description": "What is Git,  what is GitHub, and what's the difference? Learn the basics of Git and GitHub from the perspective of a Pythonista in this tutorial."}, {"id": 114, "title": "11 Beginner Tips for Learning Python Programming", "url": "https://realpython.com/python-beginner-tips/", "pub_date": "2018-04-03T14:00:00+00:00", "tags": ["basics"], "description": "In this article, you'll see several learning strategies and tips that will help jump start your journey of becoming a rockstar Python programmer."}, {"id": 115, "title": "Python IDEs and Code Editors (Guide)", "url": "https://realpython.com/python-ides-code-editors-guide/", "pub_date": "2018-03-13T21:40:51+00:00", "tags": ["basics", "tools"], "description": "Find your perfect Python development setup with this review of Python IDEs and code editors, including recommendations and screen shots."}, {"id": 116, "title": "Python Project for Beginners: Bitcoin Price Notifications", "url": "https://realpython.com/python-bitcoin-ifttt/", "pub_date": "2018-03-08T07:00:00+00:00", "tags": ["web-dev", "basics", "projects"], "description": "Build your own Bitcoin price notification service with Python and IFTTT. This tutorial is a project-based exercise for beginners looking to improve their Python coding skills by building a small real-world app."}, {"id": 117, "title": "Python Plotting With Matplotlib (Guide)", "url": "https://realpython.com/python-matplotlib-guide/", "pub_date": "2018-02-28T14:00:00+00:00", "tags": ["data-science", "basics"], "description": "This article is a beginner-to-intermediate-level walkthrough on Python and matplotlib that mixes theory with example."}, {"id": 118, "title": "Python Programming Challenge – First to Five", "url": "https://realpython.com/python-programming-contest-first-to-five/", "pub_date": "2015-09-21T13:47:22+00:00", "tags": ["community", "basics"], "description": "Come take part in a programming challenge to test your logic skills and abilities."}, {"id": 119, "title": "Scaffold a Flask Project", "url": "https://realpython.com/scaffold-a-flask-project/", "pub_date": "2015-04-27T13:52:16+00:00", "tags": ["web-dev", "basics", "flask"], "description": "This article details how to build a scaffolding tool used to generate a Flask boilerplate."}, {"id": 120, "title": "Analyzing Obesity in England With Python", "url": "https://realpython.com/analyzing-obesity-in-england-with-python/", "pub_date": "2015-03-13T13:36:19+00:00", "tags": ["data-science", "basics"], "description": "Let's look at using Python and Pandas to perform data analysis on obesity in England."}, {"id": 121, "title": "Flask by Example – Updating the UI", "url": "https://realpython.com/flask-by-example-updating-the-ui/", "pub_date": "2015-02-24T15:50:42+00:00", "tags": ["web-dev", "basics", "front-end", "flask"], "description": "In this part of the Flask by Example series, we'll update the user interface to make it more user friendly."}, {"id": 122, "title": "Setting Up Sublime Text 3 for Full Stack Python Development", "url": "https://realpython.com/setting-up-sublime-text-3-for-full-stack-python-development/", "pub_date": "2014-08-11T13:24:04+00:00", "tags": ["basics", "tools"], "description": "This article details how to set up Sublime Text for full stack Python development."}, {"id": 123, "title": "Discover Flask, Part 2 – Creating a Login Page", "url": "https://realpython.com/introduction-to-flask-part-2-creating-a-login-page/", "pub_date": "2014-06-06T19:52:26+00:00", "tags": ["web-dev", "basics", "flask"], "description": "In Part 2 of this series on the Flask framework, we'll set up a basic login page."}, {"id": 124, "title": "Discover Flask, Part 1 – Setting Up a Static Site", "url": "https://realpython.com/introduction-to-flask-part-1-setting-up-a-static-site/", "pub_date": "2014-06-04T19:22:03+00:00", "tags": ["web-dev", "basics", "flask"], "description": "In Part 1 of this series on the Flask framework, we'll set up a basic project structure then develop a static site, styled with Bootstrap."}, {"id": 125, "title": "Django 1.6 Test Driven Development", "url": "https://realpython.com/django-1-6-test-driven-development/", "pub_date": "2013-12-20T17:38:18+00:00", "tags": ["web-dev", "basics", "django", "testing"], "description": "In this tutorial, we look at test driven development in Django"}, {"id": 126, "title": "An Effective Sales Page with Bootstrap 3", "url": "https://realpython.com/an-effective-sales-page-with-bootstrap-3/", "pub_date": "2013-10-01T15:05:14+00:00", "tags": ["web-dev", "basics", "front-end"], "description": "In this tutorial, we'll be looking at Bootstrap 3 and how to customize it to create a nice landing page."}, {"id": 127, "title": "Getting Started with Bootstrap 3", "url": "https://realpython.com/getting-started-with-bootstrap-3/", "pub_date": "2013-09-13T14:04:00+00:00", "tags": ["web-dev", "basics", "front-end"], "description": "In this tutorial, we'll be looking at Bootstrap 3 and how to customize it using HTML and CSS."}, {"id": 128, "title": "Python Web Applications with Flask – Part I", "url": "https://realpython.com/python-web-applications-with-flask-part-i/", "pub_date": "2013-08-14T03:22:01+00:00", "tags": ["web-dev", "basics", "flask"], "description": "In this part of our series on Building a Web Application with Flask we'll set up our application."}, {"id": 129, "title": "Testing in Django (Part 1) – Best Practices and Examples", "url": "https://realpython.com/testing-in-django-part-1-best-practices-and-examples/", "pub_date": "2013-08-06T02:33:56+00:00", "tags": ["best-practices", "web-dev", "django", "testing", "basics"], "description": "In this tutorial, we look at the basics of unit testing in Django"}, {"id": 130, "title": "Developing with Bottle", "url": "https://realpython.com/developing-with-bottle-part-1/", "pub_date": "2013-06-18T02:33:19+00:00", "tags": ["web-dev", "basics"], "description": "Let's look at how to create a basic application with Bottle"}]